[
    "I absolutely Love This Perfume!! It smells delicious! Stays on! You only need a little. Delivery was fast! The prices are fantastic Bottle! Bottle is Pretty! I look forward to ordering more.",
    "It is an amazing fragrance",
    "I love it it's my favorite perfume 😍",
    "It’s a nice scent if you like that heavy scent. I have to spray it on my back so I do t get a headache.",
    "This is a tiny sample vial, which is fine, but it's nowhere near worth the asking price. Some reviewers raved over this perfume, but I wasn't impressed either with the scent or with the longevity.",
    "Spent 1/2 the price of original & it isn’t the real deal!! Smelt alcohol 1st spray & smells Not the same like Micro perfume company did!! Disappointed big time! Lesson learned",
    "The media could not be loaded.",
    "Like the scent.",
    "Olor duradero",
    "",
    "The scent had a very strong alcohol smell and the Baccarat Rouge 540 smell was very weak...almost nonexistent. The label was on crooked...very crooked. The atomizer was not the same atomizer that Maison Francis Kurkdjian uses on their bottles. I have purchased this fragrance before from the house that makes it. This was quite different, and not in a good way.",
    "I believe I got a fake product. Normally when I wear this, meaning the original, I get compliments from everyone. From the start of the day to the end. Never fails. This time, there is barely any scent. It's like wearing water....Soooooo Disappointed. Fake, Fake. Triple Fake...choooppss",
    "Smells like the real perfume for 2.5 seconds then disappears. I bought this bc it was going to be delivered to me before Neimen Marcus could get it to me. Wasted my money and no returns",
    "My bday gift",
    "Tried the Original Parfum which is great, but the Exrait which smells just as amazing, lasts all day long with just a small amount applied. I plan to buy more just of this sample size for travel.",
    "I’m tryna figure out is this real Baccarat because it doesn’t smell anything like it this seems like I got scammed for this because I had a smaller bottle before and this is not the Smell",
    "The perfume was previously opened and tampered with as indicated by wear and tear on the brass label and the white cardboard cut out that the perfume sits in inside the box. It comes in.",
    "I love the fragrance and it lasts all day long. A little goes a long way.",
    "I think I have found my signature fragrance. Although the perfume is quite expensive it is worth every penny. Whenever I wear this scent I get compliments from both men and women, and have to send a screenshot of the bottle. Fragrance last all day without having to reapply and lingers after you've left the room. My girlfriends husband Actually inquired as to who had used their restroom because he was obsessed with the scent it left.",
    "This perfume essence is very good quality. The bottle design and perfume color are attractive. (No damage in transit.) The seller made a special effort to deliver half way around the world before Christmas. Thank you!\n\nNote: how well high quality perfumes work on you depends on their compatibility with your skin. This one works fine for my purpose.",
    "Decepción completa, no esperaba que el tamaño era tan chico, para el precio que se paga , lo que muestran en la foto es completamente diferente . Muy mal",
    "This perfume is a scam. The item smells watered down. The scent doesn’t even show up when I spray it on my wrist and smell it. I have purchased this perfume from other venues in the past and it is a heavy musky long lasting scent. This company is fraudulent and stole hundreds of dollars refusing to give a refund for this sham of a product.",
    "Exquisito el perfume",
    "This perfume is a scam. The item smells watered down. The scent doesn’t even show up when I spray it on my wrist and smell it. I have purchased this perfume from the mall This company is fraudulent and stole...",
    "I do not advise buying this type of product it has a totally different smell odor alcohol slightly mixed with water!! No good",
    "I Purchased this because a lot of people were talking how great the smell is. Wow it’s not that great and for the price is treacherous don’t buy this it’s not worth it. It’s maybe 10 pump and done . Isn’t that great either doesn’t stay with you so just a waste of money.",
    "I just reveived my order and the spray has absolutely no smell to it. Very disappointed!",
    "Im very sad! So expensive and so bad! 😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭",
    "this item was delivered and dripping down the small container. Not worth the money.",
    "Love the smell, lasts a pretty good amount of time. Very happy with purchase and the seller was top notch."
]