[
    "I’m pretty happy with the guitar.\n\nDid a lot of research first before deciding on the Player model. The price was a huge selling point compared to the American models. Neck straight, frets flat and fret ends were perfect. But, here’s where things almost went wrong (no stars removed as this was Amazon, not Fender).\n\nWhen it arrived, I was disappointed that somehow Amazon didn’t get the memo that guitars are double boxed when shipped. Mine was shipped in the Fender box only - wet (it was raining), dinged up a bit in one corner and a hole puncture. After opening the box and inspecting the guitar, I was relieved to see no damage.",
    "Fender - White Player strat - pau ferro fretboard - Made in Mexico - $699\nAs soon as I plugged in the (Fender) instrument cable I knew something was wrong. The cable fit loosely and would come out with the slightest nudge. Reading into the issue online I found an easy fix. Unscrew the two screws on the metal plate. There is a piece of metal that should connect as shown in the picture.(the picture is one found online -not mine). Bend the metal so it fits as shown. Super easy fix all you need is a screwdriver. I deducted one star for this quality control but I've heard this guitar is a really good deal on components and playability when tuned up properly. The fretboard is flat and the frets are a bit sharp but i'm getting used to that. A Fender American Professional strat (the one that's made in the USA) has rolled edges and is a bit more comfortable to play but I've heard that this model is a bit better value at less than half the price. The strings stretched a bit the first fifteen minutes I played but now they hold their tune quite well. I hope the pickups and internal connections are good. Once I have the opportunity to play my guitar on the amp a bit I will update my review. I don't mind having to do this minor modification because now I have the right fit with the instrument but I'm certainly now a bit more skeptical of this product and on the eye out for further issues.",
    "I was a little worried about ordering a guitar from Amazon but it arrived in perfect condition. The only issue I had was the delivery guy left the box out in the front yard instead of at our door. But we were able to get it right after it was dropped off so it didn't have to sit out there.\n\nThe guitar looks and plays great. This model line is made in Mexico but sounds and feels just as good as Fender's American line of guitars from what I read. Personally, without having experience with both lines, this one is just right for me especially for the price. I was looking to upgrade from my first starter guitar which is a entry level Epiphone Les Paul Special.\n\nThe design and frets feel much more comfortable and I really like the strings Fender puts on theirs. The body feels great, not too heavy and not too light. The pickups sound amazing. 3 single coil pickups that allow you to use a 6 way switch selector. I have yet to use the whammy bar. This guitar really holds in tune or very close to it every time I go to play it.\n\nOverall being a beginner, this is a real upgrade for me. I would even recommend that someone who is just beginning to learn to play consider starting with this model if possible.\n\nI am very happy with my purchase! Thank you Fender!",
    "This was a huge disappointment. They didn’t even try to adjust the intonation or the string height. I uploaded 2 photos - the first one shows the saddles in a virtually straight line. That is a dead giveaway that they really don’t care a bit about the quality of the guitars they sell. The second photo shows the low E string off in left field somewhere. This is really frustrating to pay a lot of money for something that has the “brand” name and then get a poorly finished product. I could have gone to dozens of different manufacturers and not had to deal with this problem. I know I can straighten it out and adjust it but the issue is that they should have done that. I paid for someone to do that because this is a more expensive model. I’m thinking of sending it back.\nUpdate: I called Amazon and they said they don’t have any replacements, although they do have new ones that are more expensive. How can that be? They don’t have any way to honor the warranty too. They said call Fender. So I called Fender and after 23 minutes on hold I got to speak with someone. She was very nice and knowledgeable and said that I could take it to any authorized service provider to have them look at it. I emailed her pictures and she said it’s up to the shop to determine if they would charge to do what the factory should have done in basic quality control and inspection. I’m not happy about the Amazon thing that they don’t replace a defective item when they have new ones available. It took 4 separate calls to Amazon and finally I got through to someone in the US because the overseas help people are not allowed to do anything about this. The US guy said that they for each batch of 80 or 90, they allow 8 replacement units and they have already allocated those out so they have no more. That tells us a lot about the crappy products that they are making in their Mexico facility. After all, that’s a 10-12% rejection rate and that includes shipping damage.\nI am disappointed and disgusted with Fender. I have a lot of guitars including several vintage Strats. Obviously the quality of the ones they made in the 80’s in Fullerton are phenomenally better than the crap out of Mexico today. I don’t think anyone would disagree. I also purchased a new Japanese one this summer and that is head and shoulders above this Mexican one. I’ve decided that I will return this and avoid Fender products - and that is saying something huge! But it’s just terrible at what Fender has come to. Cheap knockoffs from overseas, high quality ones from Japan that are not available here, shoddy slapped together crap from Mexico or pay through the nose several times over for US made ones. Sad. Very sad. Bottom line, you may get a good one from Mexico, I suppose, but there’s a large documented defect rate involved and you are rolling the dice.\nThe last thing is that the “Plus” top is a total joke. There’s hardly any flame. Look at what PRS can do with a flame top for the same price - check out the Zach Meyers PRS and you’ll see what real flame tops look like. This one is a joke",
    "I chose this MIM Player Fender guitar because they are so well made and sound so good. I couldn't like this guitar any more than I do, it is fantastic!!!",
    "No trajo la palanca de tremolo",
    "Plays and sounds great rite out of the box .\nThe guitar i received is flawless I've owned many Fender Strats American and Mexican\nAnd this one is a Fender Stratocaster 100%\nI was impressed with the pickups they really brought out the true sound of a Stratocaster.",
    "I bought this to replace a strat I had 15 years ago and was excited to get it. Shipped was good. Packaging was good, double boxed. But that’s pretty much where things turned bad. Firstly, there were different gauge strings on when I picked it up. I replace them anyway so not too big of a deal but not a good start.\n\nWhen going to set the guitar up. Four of the set up screws to adjust the action are stripped. I was able to correct to some extent but not what I would want from a new guitar.\n\nLastly there is something going on with the electronics where the 1st and 2nd strings do not come through the amplifier. They resonate fine unplugged but with decreased or no sound when put through the amp. I have yet to get this checked out as I have to bring it in for someone to look at.",
    "Bought very good condition but from everything I can tell it was like new. Plays and sounds great. Good value for money and great look blue color. Love the way the pickups sound and the satin finish on the back of neck is great.",
    "At the advice of a musician who played with many bands and my having played acoustic for decades, I asked what would be a good all-around guitar. He suggested a Player strat. So, I finally got one. Having read the reviews, I thought I may be getting more than the guitar. But a strat was all that showed up through the US postal service in good condition. The instrument is well made but as stated by one the frets are a bit sharp so will need to polish the edges. The thin manual that came had an English warranty but the description of the controls, adjustments, etc. In Spanish. Fender does not have a manual specifically for the player but several that get close and documentation on setting it up properly, if you know what version of tuning knobs, truss rod, tremolo you have. And no way to know unless you know. So it plays well but needs some adjustments that I guess I will have to dig deeper to work through. The point being. If you do not have the background and resources, be ready to learn more than how to play the instrument or find a knowledgeable shop to help. But nice guitar.",
    "It's what I expected I suppose. Setup sucks and I imagine whoever returned it just didn't know how to fix the issues, if you don't TRAIN is the acronym to remember (TRuss,Action, Intonation and Noodle). For me that's no big deal. Seems playable other than that. If you have sticky fingers tho go dark woods and not maple. The gloss adds to the finger tack.",
    "MOST RECENT UPDATE!\nFender refuses to acknowledge my BBB complaint against them. They refuse to reply to the BBB\nThe BBB Suggested I take it up with my AG. Which I have.\nI sincerely hope Fender restructures after this fight.\nOnce again. DO NOT BUY FENDER! they absolutely flipping SUCK\n\nUpdate 2\nMessages between myself and Fender:\n\nGuitar Center Jacksonville Fl. Your websites direct referral.\nYes a tech was spoken to.\nAnd I’m going to explain to you the same thing I’ve emailed four times now.\nThe “tech” told me to take it to my local Sam ash.\nAs the Strat was purchased thru Sam Ash. Just not this store.\nI took the guitar there and AS PREVIOUSLY STATED was told this a warranty claim through Fender and I was outside the 45 day replacement date.\nI purchased the guitar 12/28/2020 and it was delivered 01/05/2021.\nSo… as I’ve explained to you more than once,\nI am caught in a blaming cycle where no one wants to assume responsibility.\nThe guitar is flipping brand new!\nI’ve played it, maybe a dozen times.\nNever dropped and always stored secure!\nThe tech at Guitar center (the one recommended on your website) stated this a polymer crack that grows over time with heat.\nThat’s why I never recognized it on initial inspection. It was hairline and unnoticeable to the human eye.\nThis is where Sam Ash is giving me the “it’s not our fault bs”.\nI ask you, how am I able to detect a hair line crack when first delivered?\nDo you require your customers to inspect all Fender guitars with optic lenses? Perhaps a CAD scan and model should be reproduced?\nC’mon dude!\nThis is absolutely ridiculous!\nI want what I paid for!\nI’m tired of this run around and absolutely degrading, condescending, emails from the out of state Sam Ash that sold me this flawed Guitar.\n\nI’ll let you know that Guitar Center Jacksonville FL told me they would immediately replace the Strat had I purchased it through them.\n\nAnd I promise Fender;\nI WILL NEVER DO BUSINESS WITH SAM ASH AGAIN!\nYou should drop them as a distributor.\n\nORIGINAL REVIEW\nItem arrives with a unnoticeable micro crack that grew over the 2 months I’ve owned this product. The defect was hidden on initial deliver inspection. Therefore, unnoticeable.\nSeller refuses to replace item and brushes me off to Fender warranty support and leaves the buyer on my own to take care of an obvious manufacturer defect.\n\nUpdate:\n\nI followed the steps Fender supplied to me about obtaining warranty service.\nWhen I arrived at Guitar Center (a factory authorized repair center) the manager was appalled at your communication with me.\nSpecifically, he stated that the crack is a poly crack that grew with heat and any, decent tech would have recognized the flaw and immediately start the replacement process.\nHe recommended I go to my local Sam Ash store.\nSo I did.\nThe staff at the Sam Ash was more than complimentary. They phoned Fender Techs for me and were immediately able to resolve my issue.\nAdditionally, the Sam Ash employees were able to trace what store the broken Strat was shipped from.\nHere comes the good part.\nFender will replace my guitar through my local Sam Ash.\nGood people there.\nI also know where my Strat was shipped\nFrom.\nThe Sam Ash store # etc.\nand while I will give my local SA store\nA glowing recommendation.\nI will illiterate a comprehensive review of your store and your customer service playbook.\nYou should have your store Manager call me before I post.\nYour attitude and lack of caring appalled employees of guitar center and Sam Ash.\nI will think very hard to ever do business with Sam Ash again.\nGuitar Center informed me that the Manufacturer defect would be rectified immediately. The same from my local Sam Ash.\nYour store has issues.\nThese issues will be forewarned and forwarded to Sam Ash superiors.\n\nStephen Johnson\n\nSigned,\nFreakin more than pissed off and frustrated!\nStephen Johnson",
    "The sound is excellent, sounds like a strat should.\nThe guitar seemed ok at first, after set up, but noticed chipping\naround the skunk strip (the strip that covers the truss rod joint),\nsomething is wrong with the neck, even with the saddle screws\nat G string all the way in, there is still unacceptable fret buzz.\nMine may be a second, I've had this model before, one that had no issues,\nI will wind up buying another and hope for the best.",
    "The guitar is awesome, but i ordered as “new” and got a used guitar instead. Noticed fingerprints in the guitar immediately, and the strings go out of tune EVERYTIME I try to tune a string. It’s such a hassle and I’m tired of the strings loosing its tune whenever I play (Yes I’ve changed the strings, twice)",
    "This guitar plays well and was a bargain at this price!",
    "I got this for my husband for Christmas and it is now his favorite guitar.",
    "Quality workmanship all the way. Well protected and packed. Wonderful playability in true Fender Strat form. :-)",
    "The quality of the guitar is awesome. The payment plan is super helpful and the packaging was great. Shipped quickly.",
    "This guitar sounds and plays great. Out of the box it looked like nothing had been adjusted, but after spending a little time on a restring and adjustments, it's comfortable to play and sounds amazing.",
    "The guitar as it arrived needed a complete setup. I was only able to get it part of the way there; I had to take it into a professional for the rest. In addition to neck/bridge adjustments, the fret ends were a bit too much out and needed filing; whether that's a manufacturing issue -or- the fact that it originated in Mexico, spent time in a store in Texas, and then got shipped to Chicago in the late fall/early winter.\nRegardless, sans full setup it plays pretty good, sounds great, and I'm happy with my purchase.",
    "Been getting back into guitar and have always been a big Fender fan. I bought a different make electric earlier this year which I love but it has a hard tail. I wanted something a bit more versatile. I’ve always wanted a legit strat as squier tends to be garbage. Amazon had this player series, made in Mexico strat for 140 a month over five months so the hit isn’t too big. Packaging was ok and guitar was not damaged. I did have to tune is several times as the tremolo was nearly all the way down. The pickups were also at different heights so I had to level those as well. At some point I’ll replace the nut with something higher quality.",
    "Its been ten years since I bought my last guitar; a 2009 High Way-1 Stratocaster. It seem much has changed since then. Whatever process Fender developed for curing wood now, I am sold. Though this Player Stratocaster is by far the least expensive genuine Stratocaster I've own, this Mexican baby has become my new #1. The wood, both body and neck, are hard, like steel, and has real mojo. Out of the box, it had a decent setup, but due to the plastic nut and bent steel string tree, this guitar stuck off pitch, either high or low, after engaging vibrato. I intalled a brass nut and a roller string tree. That made tuning come back true. On my Player, I also installed a Callaham bridge block and tempered steel saddles plus Fender Locking Tuners. Done a few cosmetic and electronic tweaks too. Blasted Dream Grinding Machine!",
    "this came to me from the chicago music exchange. right out of the box everything was set up perfectly! just a minor tuning and I was playing the best guitar I`ve ever owned! for a player guitar out of mexico it plays just like an american made fender! I`ve played american fenders and I can see no difference in this one. I would buy this again if I had the money! especially if it came from the chicago music exchange!! they delivered it in record time. and perfectly set up to play!! I want to thank anyone who had any hand in getting this guitar to me! thank you amazon and the chicago music exchange!!!",
    "This was my first time buying a guitar on-line. I was a little nervous and skeptical . . . It arrived in excellent condition - not a single blemish! Plays and sounds great - very pleased. I have had this guitar for over 6 months and play it daily - I still love it! Highly recommend! You will have to set it up yourself (Action, Intonation, etc) - this is to be expected especially since humidity and temp vary with each customer location - it was \"close\" out of the box.",
    "This is my first electric guitar and it is really great. The only complaint I have is there was some buzz of the D string and I did have to make some minor adjustments to the bridge and springs right out of the box. But honestly it is a beautiful guitar and I am super happy with this purchase. The neck was straight and everything functions wonderfully except for the one string.",
    "My Player Strat finally arrived on Wednesday-UPS was stuck in a big snow backup for a long time. I have to tell you, I was BLOWN AWAY when I opened the box. You guys not only nailed it with the guitar, but you included a Fender case, and the case was full of goodies like strap, cable, tuner, capo, strings and picks.\n\nWow! Way more than I thought I ordered. I had to double-check my order, and that just confirmed that you guys included TONS of extras. I hear this is called “lagniappe,” or props for creating happy customers.\n\nWell that is DEFINITELY the case, because if I EVER need any gear, I am gonna be buying it from AUSTIN BAZAAR.\nI am loving the Strat, and having all of this good will with it makes it feel like the best deal on the best guitar EVER.\nThank you so much!\n\nGraying GuitarMan, Redmond WA",
    "Great price I fill like I got a great price for it",
    "I have absolutely no complaints about the guitar itself. My 4 star review is due to the tremolo bar not being in the package and not being able to get Amazon to send me one. The only option is to return the one I have and wait for a new one to come. I've already opened the guitar and have been playing with it, so it;'s not worth the hassle.",
    "I have a long and extensive professional experience with many quality acoustic and electric guitars. This is an incredible value for a highly playable and wonderfully sounding and versatile guitar. It greatly benefits from having a thorough setup by a professional luthier.",
    "Nice finish overall, sounds great, no frett buzz, however frett ends on neck finish is not even close to being acceptable. I have played Squire guitars that are better.",
    "I've been playing guitar for over 40 years and have had many guitars of many makes and models. This Strat may be my all-time favorite. It arrived on time, damage-free, and immediately playable (after bringing the strings up to pitch). The neck was straight, intonation perfect, and it stays in tune. I've been playing it for three days and can't find anything about it that I don't like. Highly recommended.",
    "Upon opening the packaging, which was not impressive, I found one of the tuners was sheered off from improper handling. I was able to do the repair and found fret hum on 4 of the 6 six strings. The look is great, again, fret issues on these guitars seems to be the biggest complaint, too high and sharp edges. I rank this low because this is before I have even plugged it in. The guitar seems to have an issue staying in tune with mild playing, I had to re-tune 3 times in 10 minutes. I recommend not buying guitars online. Go to a shop where they are able to address any issues with the instrument.",
    "I've owned several strats over the years. Most had small quality issues. All were made in the USA. This guitar is by far higher quality than any of my older ones. It stays in tune for days. Great value.",
    "Love playing this guitar ,sweet neck ,sounds great and love the white !! Impressive!!!",
    "The guitar sounds fantastic! The only reason I am not giving it Five stars is that the guitar was delivered in need of adjustments as the high b and e strings were buzzing like a sitar. With the money spent on this you would think the guitar would be set up prior to shipping. I had to take guitar into Guitar center to have it adjusted.",
    "Great strat !! This is my first one one , so have nothing to compare too but , held American stat & this one from mex is just as good ! She’s a beaut!",
    "This strat feels so solid, balanced, and smooth. It is beautiful. Most of you already know this anyhow. It motivates and inspires me.",
    "I can’t put this thing down!! Absolutely love it and it is a joy to play. It arrived in flawless condition even though the packaging didn’t seem like enough, the only thing I didn’t like was the 13th fret had a darker stripe in the wood grain, a very minor thing. Other than that the thing sounds great and well worth it!",
    "This instrument is incredible! Fits nice in my hands and sounds fantastic! I love the color as it stands out. I would recommend this for beginners and professionals as I believe that I am in the middle with a ton of work ahead of me :) Don't think about, buy this incredible piece of instrument.",
    "This strat was made in Mexico and the fretboard and neck are different from my other strat which was made in China. How naive I was to think that the Fender name was not entirely \"made in the U.S.A\". Otherwise, the electronics, styling were damn good. The \"locking\" spring for the vibrato arm was missing and I need to get one to stabilize arm while playing.",
    "There is only one problem, the first one I bought came from gearlux and was defective the plug in did not hold my cable and the high e had serious buzzing so I had to return it and the second one came from chicago music exchange and was perfect I love it.",
    "It may be a Mexican but it plays real sweet",
    "The guitar itself is great!!! I'm so disappointed on how it was shipped. There was no care taken on padding or making sure the thin box it was in was secure. A guitar like this should have been given more care. I received it with a hairline crack on the back side of the body, right where it's joined to the fretboard. Its not affected playability wise but due to the money spent I would've love to have it in perfect condition.",
    "I purchased the Polar white with Pau Ferro fretboard and SSS, to add the SSS sound alongside my Sage green HSH Strat. Both are MIM Player strats and both came in perfect condition. On this one the strings were a bit tarnished and off sounding but a new set put that right. I set the guitar up myself on arrival and it plays beautifully.",
    "I purchased this exact same guitar less than a year before this one. Had to get one for a friend because we always matched in the 80's.\nIts just need the littlest fix on the radius but it come ready.",
    "Highly recommend this guitar. I was on the fence about getting a Stratocaster but I’m very happy i decided to buy one. I would take to shop to set up (lower action, etc) too. But overal great guitar, no complaints",
    "It's a fender stratocaster. It does strat things. It feels incredible. It plays like a dream. It sounds magical. It's exactly what I wanted it to be. Thanks Fender.",
    "I am a beginner so I can't make many comparisons to other guitars or years. I can only say it's beautiful and I love it! So happy I bought it and am learning more every day. Was made easy thanks to Amazon and payments. Even when I'm not playing it, I catch myself looking at it, like a work of art, which it is!",
    "This is very good at being a Stratocaster. Better than I am at being a guitarist. Needed minor adjustment to fix fret buzz, but other than that I've had no problems. Easy to play, sounds great clean or overdriven.",
    "Everything is great other than the fact that the B string buzzes when I play the open string... it is fine any time I fret it...\nStill waiting for the company to get back to me about replacement and it’s been longer than they promised",
    "The only problem I experienced was a broken highest string, this was promptly rectified by Amazon. They sent me a whole, fresh set of strings. I am extremely satisfied with this product and their service. Highly recommend further purchases. Again, this is a beautiful guitar, it plays excellently.",
    "Awesome guitar!! Great sound and feel",
    "The Fender Mexican Strat is the best guitar I've owned. Paired with a new Fender Blues Jr. tweed amp, it sounds heavenly :)",
    "All of the MIM (Made in Mexico) Fenders I’ve bought (4 from Amazon), have horrible fret ends that are like sharp razors tearing at your hand as you slide up and down the neck. Avoid these and get a better guitar at a cheaper price.",
    "These new player series are more less junk. I couldn't believe how bad the fit and finish was. Fenders quality control has all but disappeared. When the squire is of better quality, you know there's a problem!",
    "Let’s face It Fender distributes quality guitars. This is no different.\n\nSounds and feels great.",
    "Love the guitar.. I have about 11 different guitars.. and I just got the custom telecaster .. and then this strat. Did make it to my top picks but still is a nice guitar!",
    "When this guitar arrived there was not time to get it exchanged before it was needed for pre-Christmas program. Upon arrival one of the Tone knobs had a hole in the center, but most importantly many of the frets were sharp on both ends, and sliding your hand up or down the neck assured you of a little blood with each movement. Also, the strings were much too high for comfortable playing. I took it to a music store to see if it could be made playable within a couple of days. The previous owner, whom I knew well, happened to be in the store, and he told me he could make it playable for me. It is now playable to some extent, but I hate the way it feels and have ordered a Yamaha guitar as a replacement. I am aware that this model was made in Mexico, but I think it was too expensive to have these flaws when delivered. Caveat Emptor! (Buyer Beware!)",
    "it plays well and looks good and the Pau Ferro finger board is very nice looking and fells great. it was a great deal for this guitar. would highly recommend for those of us that can't afford a made is U S A strat",
    "Great fit and finish, setup,and neck feel.pickups sound great, nice \"quack on pos 2 and 4. Overall quality very high.",
    "Really great guitar for the price tag. I would definitely recommend",
    "I was super excited to order my Strat but as soon as it came in I pulled it out of the box and gave it a strum....surprise! string buzz. the top 3 strings were buzzing like crazy on an open strum. I was a little bummed out. After experimenting through couple sets of strings and still nothing worked I ended up paying to have my guitar professionally set up and adjusted, it sounded great afterwards. I thought I could save some money and time ordering through amazon but next time I will probably go to my local music store. So much less headaches. the guitar itself sounds great though, after adjusting!",
    "Love this item\nWorth every penny ❤️❤️❤️",
    "The fretboard is glossy, easy to move across the guitar board",
    "Set up out box",
    "My fiancé loves it!!",
    "Awesome sounding!",
    "era mi sueno de toda la vida",
    "Would recommend to anyone looking for a strat, wonderfully built and great value for the price. You'll never need to replace this guitar.",
    "Love it. Feels easier to play than my epiphone (which is also great) and sounds awesome. I'm a novice player, and this has all I need.",
    "Plays great, may need a setup due to shipping. The new features are great like the extra fret and the bridge now has the second tone knob wired to it.",
    "Perfect.Im real happy with it, looks and sounds great.Shipped fast\nThank you,",
    "Received a great looking flawless Fender player stratocaster.",
    "For my daughter and she loves it!",
    "Less than 30 days old. When plugged in many pops and static through all pickup positions even with different amps/cables. 4th fret different height than other frets. Fret edges ultra sharp. Support page to Fender goes to 404 website url not found. Don't waste your time, money or energy. Look elsewhere!",
    "Amazing guitar for the price! Beautiful tone and excellent quality.",
    "Awesome guitar good price pretty happy with my purchase",
    "Can't really complain. Good guitar at a good price.",
    "Beautiful guitar.",
    "On time and as promised",
    "Love the sound",
    "Value would be great, except:\n1. The volume knob was completely non-functional.\n2. The Tremolo bar did not clear the volume/tone knobs.\n3. Despite the quality control tag on the guitar (signed off by two different people, nonetheless), this one obviously would not pass a quality control inspection by any valid QC authority.\n\nPoor job, Fender!",
    "Beautiful and sounds great!",
    "Four people handled this guitar w/o noticing the cord input was upside down! Nice! Guess I have to spend $2000 on an American made. SMH",
    "Plays great!",
    "Not new. Super bummed it arrived chipped and clearly not in new packaging.",
    "I received it with a scrash",
    "I went to guitar center to buy one of these and picked up six different guitars with sharp fret edges, I could not believe every one of them was unplayable unless you like cutting your fingers. They said they had one that the guitar tech had filed and rounded the sharp fret edges. So we plug it in and the high E string has a constant buzz when played open. I look at the neck and its slightly bent so he tightens the truss rod and it does no good. He measures the fret height and they are not even close to even but thats not making the E buzz. At this point, there is no way i am paying 800 for a brand new guitar that is built as well as a botttom of the line squier, probably worse. I am now only there to see what the issue is and how many of these are this bad. I bring two more over and check them out, necks are not straight on any of them and as I said they are unplayable wihtout filing the fret edges. He replaces the spring and that doesnt stop the buzzing. He says he will have to pull the guitar apart and I can come back and get it if I want it or if he cant fix it he will order a new one. NO WAY. I will never buy another fender. I had a mexican strat about 10 years ago that was built fairly well and was half of what they cost now. An 800 dollar guitar that is unplayable wihtout 300 dollars worth of repair?? I dont think so. Get it together fender, they are trying to push these out so fast due to the rise in demand for guitars during the lockdown that the little bit of quality control they had has disappeared. I would not pay 150 for one of these guitars fender is making today and you could not pay me to take one unseen. I went to another guitar store and looked at yamahas and every one of them was perfect. Even the 200 dollar pacificas were better than the american strats I saw. I ended up buying a top of the line pacifica, a pac612viifmx which is amazing and I would say better than an american strat andit was 649 dollars, I also played the yamaha revstar which is comparable to a gibson sg or a les paul and even the cheapest revstar has a solid neck and zero defects and sound amazing. I feel bad for new players that dont know to look for these things because they see the name fender and assume that an 800 or 1500 dollar guitar will be ready to go and they end up getting a pos that painful to play and listen to so they end up putting it down and never picking it back up. Do yourself a favor and look for sharp fret edges along the neck, they should not be that way. Hold the guitar up and see if the neck is straight some will be off but can be fixed by adjusted the truss rod but some are so bad they cannot be fixed. Play every note open in every switch position, it should be clean and the pickups should function. If your guitar has any of these issues send it back, there is no excuse for a new guitar at this price point ohave these issues. These are jsut the basic things that make a guitar playable and fender cannot even get them right anymore.",
    "Preface: I purchased this guitar in a different way. I bought the parts separately and put them together to save myself some money. The neck and neck pocket fit together perfectly with no wiggle and no bad angles which is probably the most important part of a good sounding guitar. the bent steel saddles were easy to adjust and I was able to get perfect intonation on each string. The pickups are a nice upgrade from the ceramic pickups used in the old MIM models and give a warmer fuller sound almost like the vintage 50's pickups in my FSR strat but with higher output. The feel of the neck is also a big improvement from the MIM series (the feel is closer to the neck on my American Pro Telecaster than it is to my 2011 Stratocaster). If you've read this far you have probably surmised that I have a fair amount of Fender guitars. In my opinion they are the easiest guitars to work on, fix, upgrade parts, and personalize. I like strats because the bridge allows easy setup for alternate tunings. If you're looking for your first guitar, you can't go wrong with the Player Series Stratocaster (paired with the Fender Mustang GT40 amp).",
    "Bought one elsewhere had it about a year now have no complaints got one after extensive research because of new features have 20 plus guitars of just about every top brand from low price to $$$$$$$$$been playing my whole life (52 years old) and love this player series with all the new features.\nSolid feel construction well built fret work great no edge, etc.....don't feel like getting all guitar geeky with details because it's all good, Players series was made by specs asked for by Fender enthusiast who wanted certain things and Fender listened and I think they nailed it, who cares it's made in Mexico (MiM) if you know anything about that most of the parts come from California anyway. Don't take my word for it YouTube videos nothing but great reviews. I think this will or hope these will be a sleeper under the radar and years later will be sought after. Very very happy with mine, got maple neck because it's more of a vintage style look. Go for it. 🎸🎸🎸🎸🎸",
    "I got mine elsewhere, but just want to tell prospective buyers that there is no difference between these and the USA strats they replaced. I would actually say they’re better, after already using mine in my band. The dedicated bridge Tone is a fantastic tool and I can’t fault the pups! The new neck is incredibly comfortable and mine was perfectly set up straight from factory. Imo fender easily surpass Gibson in their creativity and value for money! If you want a strat, save money and just get one of these. No need for higher models; you can always mod it later on. You might mod a more expensive guitar anyways!",
    "Of all the Mexican Strat I've owned, this is the best one, by a mile.\nPerfect finish and gloss.\nThe grain pattern on the neck is gorgeous. All the hardware seem to\nbe the same as my 2013 American Standard. The pickups are bright but not harsh.\nThis isn't necessary but I rolled the fret ends more to my liking with a sandpaper block.\nThe action and intonation was spot on out of the box.\nWell done.",
    "Sadly I had a bad one, this is my second fender that comes with defects, as you can see in the pictures, I would not recommend to buy from this place.",
    "Very good guitar except it will not hold tune, the tuners are bad, it's a less than 50 dollar fix.",
    "all good. just like an USA model.",
    "typical fender quality. what wasn't typical was the service I received. top shelf. not only did I receive it 3 days earlier than expected. It was inspected and playable right out of the box and let's not forget about the incredible discount. I will not hesitate to do business with Empire Music in the future.",
    "I absolutely love this guitar.",
    "Perfect birthday gift for our daughter",
    "Mexican made Fender Strat Pau Farrell, I'm surprise on the built quality and the finished color, the only one thing I need to do is smooth out the shard fret end area.",
    "Excellent Fender guitar. Played as expected, sounds great. The selling point for me was not the price which was equal to Guitar Center, but it was the ability to make interest free payments to amazon."
]