[
    "I am a DSLR photographer. I do a lot of bird photography. I have a nikon 200-500mm ED VR with a Nikon D750, a Canon 6D Mark II with a Sigma 150-650mm, a Pentax K-1 with a Pentax 150-450mm AW, and a Canon 77D with a Canon 400mm L, a Sigma 100-400mm with a Nikon D3400.\n\nI am describing my gear to the reader so he/she will see how my review will be influenced by my current setup. Anytime I carry any of my gear mentioned above, I am looking at a good 4 to 8 lbs of gear strapped on my chest and hiking miles of trail. The Nikon Coolpix P1000 can never beat the image quality of a proper DSLR. The Nikon Coolpix P1000 is NO MATCH against sharpness and clarity of the images that my DSLRs produce. NO MATCH...and that is understandable. BUT...sometimes, I feel like I don't want to haul heavy gear. Sometimes, I just want to enjoy the scenery and the walk but still having the capability to take photos. Sometimes, I just want to be silly and just take photos of anything...a rock, a bird, a raccoon paw print, the bark of a tree. Enter the Nikon P1000.\n\nThe Nikon Coolpix P1000 is an excellent point and shoot camera as long you know its limitations. The camera uses a tiny sensor, a smartphone sensor, so low light is the first challenge already. Now, there is a way to squeeze out light from this sensor by going Manual, or Aperture Priority and adjusting the ISO to 3200 or 6400 (max ISO). The next challenge is the 125X zoom power. You can get great quality images between 24-1500mm handheld as long as you keep your shutter speed around 500-1000, and then push the ISO a bit. Shooting handheld with this camera is doable as long you keep your zoom range within a reasonable range. Once you push pass 1500, you are now faced with hand shaking, wind, your breathing, the twitch of your arm, they start multiplying ten-fold as you push your zoom range closer to 3000mm. The next question is: do you need a tripod to push 3000? This is up to you. Remember though, when you push 3000mm even with a tripod, the quality of the image degrades because of the distance and size of the subject. This is a fact and it must be accepted by the user because it's just how the technology was built into this system, and the reality that 3000mm will start picking up heat shimmers, wind etc start showing up. It is the nature of super-telephoto lenses- any lens in the market. Do not be upset or disappointed when you see these issues at higher zooms, it is not Coolpix P1000s fault. It's just the nature of super zooms.\n\nLet's get the weight issue out of the way. It's about 2lbs maybe? Not sure because I am so used to carrying heavy camera gear that having this Coolpix P1000, to me, is very light. It might feel heavy for others not used to carrying heavy camera gear. But for me, this camera is light as \"feather\" so to speak, in relation to my heavy gear. Anyway, the point is..it's not going to break your hip or back. After you use this camera on several trips and hikes, your body will eventually adjust to the weight.\n\nWhat about images within ranges of 24-1500? I can say they look good to great. I know this is a point and shoot camera but if you really want to get the best out of this camera, the user needs to learn other forms of shooting styles, particularly using the different shooting modes- M, A, S. Trust me. Learning these other shooting modes will really bring out Nikon Coolpix P1000s capabilities from a point and shoot to a intermediate \"DSLR\"-like features.\n\nThe Nikon Coolpix P1000 also has features like RAW format. Note that if you are using RAW format, the digital zoom is not available. Optical zoom at RAW format only goes up to 3000mm. Note that there are two zooms...Optical and Digital. User needs to read the full manual just in case they notice a function doesn't work; chances are the functionality isn't available at that moment because the camera locked you out because of a setting you made. Again, these are all described in full manual. The Quick manual that came with the camera is just a quick reference guide. You will need to download the full manual free from Nikon USA's website. This full manual will tell you EVERYTHING that you need to know about the camera.\n\nThe Coolpix also has other \"DSLR\" like features like Spot metering, Center-weighted, Matrix. It also has manual AF select, Spot focusing; typical focusing features found in proper DSLRs. You can also set the ISO number. If you want to change ISO without going thru the MENU interface, you can assign the FN button to pull up the ISO numbers. Lots of neat stuff. All of thse are described in the full manual.\n\nWhat about battery use? You will need an extra battery. Please please use Nikon batteries. Do not use third-party batteries. Since you've already invested $1000 on a camera, there's no reason for you to go cheap on the battery. Bite the bullet and get a Nikon battery. Don't get those Wasabi or Watson batteries. Spend a bit more on real genuine Nikon batteries. Rated at 250 shots according to Nikon. Some ways to save battery power is to not use the Monitor all the time. Have the auto power off setting at 30 seconds.\n\nThe Nikon Coolpix comes with a strap, a Nikon battery, a USB cable, a USB charging adapter, warranty card, manual, lens hood, lens cap.\n\nAccessories you need to start with? I strongly suggest getting a UV lens filter for this camera. The filter size is 77mm. I also suggest using a shoulder strap instead of the neck strap that came with the Nikon Coolpix P1000. Never ever strap a camera around your neck. I really think neck straps should not be used for cameras of this size as this causes neck strain. Please get a good shoulder strap. You might want to get a wired Nikon MC-DC2 remote release cord. It's no expensive. Do not get the Nikon Bluetooth remote cord- too expensive. Start with the Nikon MC-DC2. This remote cord helps you press the shutter button remotely (it's wired) to reduce vibration/shaking when you are focusing at a distant object; for example, the moon. You might want to invest on tripod. Just make sure the camera is well-tethered to you when attaching this camera to a tripod.\n\nOverall, I am happy with my Nikon Coolpix P1000. I am still testing all its capabilities. I recommend this camera to those looking for an all in one camera. Again, I can't stress enough about knowing its limitations. It takes great images as long as you know how to utilize its \"powers\".\n\nAnd finally, practice practice practice. The camera is just a device, majority of the work will have to come from the user for this camera to come up with great images. Highly recommended camera.",
    "Wildlife around my house. Everything I like.",
    "Update: After several months and over 10,000 photos of birds and other wildlife, I have upgraded my review to 5 stars. This is clearly the best birding camera I have ever owned, including a Canon 7D DSLR camera with a 400mm zoom lens. I have found that if I turn the display inward (facing into the back of the camera) it will stay off. The viewfinder also stays off unless I lift the camera to my face to view it. So, I can leave the camera turned on while I take nature walks without running down the battery as fast. This allows me to capture pictures much faster before a bird or other subject moves out of sight. The battery still runs down after about 1.5 hours, but I keep a spare battery in my pocket. This allows me to catch birds in flight almost as easily as the 7D. For birds sitting still, especially at long distances, the P1000 is way better, hands down. Low light performance is also way better with the P1000. Videos of an eagle nest at 1/3 mile using a tripod are very good, as good as our $1600 spotting scope. Viewing the movie as it is being taken on the display screen is also about as good as our spotting scope.\n\nOriginal review:\nThe best part about this camera is the electronic viewfinder. It is bright and detailed enough to make the camera like a hand-held image-stabilized spotting scope with automatic focus and brightness adjustment. I watched an eagle pair working on their nest from 1/3 mile away. The view through the view finder was almost as good as a $1600 spotting scope (85mm x 60). That alone is worth the price. I tried to upload a hand-held movie of it, but the upload conversion turned it into garbage. The original movie was almost as good as the view through the viewfinder.\n\nThe still pictures at long zoom look substantially less detailed than what the eye sees through the viewfinder. That tells me that the image processing (frame averaging, etc.) in human vision is better than in the camera. So, we can expect that future super-zoom cameras will improve dramatically as the image processing becomes faster and more sophisticated.\n\nLow light performance, especially autofocus at long zoom settings is bad, but it is easy to quickly switch to manual focus. The focus ring is easy to operate.\n\nI compared this to my old Nikon P900 and found no obvious improvement in zoom reach. The picture is bigger at max zoom, but the amount of detail is about the same. So the increase is size, weight was for naught.\n\nI still consider this a substantial upgrade because of the brighter and more detailed viewfinder and the easy manual focus. That makes a huge difference in finding the bird or other target, composing the picture, and adjusting brightness and focus.\n\nIf I could redesign the P900 to my liking, I would make its grip bigger to fit my large hands, make the battery bigger, make the the battery charge indication more accurate, replace the viewfinder with the one from the P1000, and give it an adjustment ring and manual focus like the P1000.",
    "So this is a quick overview of how this camera will compare against the P900 for WILDLIFE photography. I feel Very few reviewers on YOUTUBE get this. I see reviews in the city like what the heck guys this camera is not the strongest in street photography probably the worse since it is So HUGE!!!\n\nOk, from the day the P1000 was announced I put up a post asking people if they were excited for the P1000. This post got crazy huge. Day 1 I pre-ordered it. After the upcoming weeks I started to question my order. There were some thing that scared me off from the camera. The questionable 3000mm zoom the lack of info on the new sensor and the list goes on an on.\n\nAnyway, I finally got the courage to drop 1K on it and it show up this morning. Part of me ordering the camera is there is so little info on how it works in wildlife for photography.\n\nNow I shoot wildlife with my P900 just as much as my DSLR gear. So after playing with the p1000 for the last few hours here are the quick improvements if you were concerned.\n\n1. Image quality ---> Yes better than the P900 , better noise, highlights, and sharpness is that or better. Under 2000mm for sure\n\n2. Ease of use, Yes more buttons manual focus rings, works faster, focus fast ect. Feels more like a DSLR.\n\n3. Buffer for shooting JPegs, Yes about 2 to 3 times more buffer it is what I needed the most for action photos. THIS was huge. I am not totally happy with the buffer but indeed much better.\n\n4. Build Quality--> Way better hands down,\n\nNIkon has made this for the WILDLIFE Hardcore... You can feel the direction they improved this camera. Higher build quality, more weight, It feels like if you really wanted to get serious about photography at almost a professional level this is what I would use. Durable like a DSLR NO but serious yes.\n\nLooking back at my photos 10 years ago with Nikon D80, d90 E500 and 500mm lenses, This beat them hands down in quality of photos and usability ect reach.\n\nIf you have any reservations on improvements do not be. They did a great job but my only concern is that it is made for TOO Serious of Photographers and will be considered a niche camera do to its size.\n\nIf you have any questions please ask. My self serving needs are I want more cameras like this versus my DSLR gear. I like DSLRS but they are super heavy in the 600 mm range.\n\nI might put out a Youtube Video comparing the differences??\n\nI think the reviews on this camera have been horrible so far. They concentrate on too many things as a general use camera. Again street photography is the last thing i would use it for.\n\nAny questions please ask\n\nThanks",
    "I was fortunate to buy a like-new camera from Japan. This is *not* an everyday camera, it's big and heavy, but I've taken photos of structures 11 miles away. And decent images of people a few miles away. There is even a built-in \"moon mode\" that set the focus at infinity and compensates for a bright moon filling most of the frame. For quality images from this tiny sensor, I stack several images to reduce noise and improve the detail. Distant shots are nearly always affected by thermal distortion, that's a given.\nFor walk-around shots, your current phone will probably give better results. For distant shots (and even photos of planets -- search the web) it's great. I'm certainly glad I purchased this niche camera, especially at a used price and with Amazon's return policy.\nI've attached a (stacked) photo of the Arizona Memorial from the U.S.S.Missouri",
    "Update October 12, 2018:\nI have completed four photo shoots since reporting the “hang up” problem. The camera operated flawlessly as it should. No problems. Had to take videos and switch back to stills quickly, back and forth several times. Camera kept right up without missing a beat and stills look great. Usually there is a slight lull when going between videos and still shots. Pleased with operations. Another plus for the P1000. Changed rating back to 5 stars.\n\nUpdate October 1, 2018:\nMy P1000 “hung up” on a photo field trip. After taking a photo, it would not focus or operate, or so it seemed. After a few seconds it took an exposure ( of the ground). This happened about four times after turning the power off then back on. Camera would operate fine then stop. I would wait to see if an exposure would happen. Sometimes it would. Checked self timer and it was off. Camera, zoom control, shutter would not work and only way to get camera operating again is to turn power off and on. I am thinking it is a software glitch. Anyone else have this problem? I have over 5K+ exposures on the camera and has worked flawlessly until now. Dropped my review from 5 to 4 stars.\nUpdate to original review:\nAdded couple shots of the moon. Saw the moon image done with ad for the P1000 and saw the full moon and wanted to see if the sample shown was for real. Well, here’s my shots. What do you think? Larger shot done at max zoom (non digital to maintain sharpness).\n\nFirst off, I’ve used my P900 for a couple of years on any photo shoot you can name. I’ve used it as a video capture to single exposures. From sports to nature closeups. I am very happy with the P900.\nWhen I heard Nikon was coming out with the P1000, I put my order in for one. I got it in a week ago and read through the instructions, got it setup and ready. I have already taken it and my P900 to three photo shoots. Exposures were near perfect. I liked the extra bright viewfinder and how much clearer/sharper it is. The size is larger and heavier than the P900. At first it seemed a bit backwards in design but after using the camera I found the extra size and weight to help keep the camera steady on the longer zoom shots. The camera got alot of attention and most inquiries were positive once they got it in their hands. The menu is easy to use very similar to the P900. I especially appreciated the sunshade provided that was left off the P900 (Had to buy seperately). I also like the ‘Hot Shoe’ that was lacking on the P900. Another feature is ability to manual focus ring. Just flip a switch and focus away. If Nikon continues with cameras like the P1000, why would anyone need a DSLR? (Just kidding - I still love my DSLR Nikons!)\nFor an all around-do-it-all Point and Shoot shooting or videos, this one is a must. Recommeded.",
    "Let me state that I am an internationally published professional photographer and was an official contributor for Playboy SE Inc. for 5 years, so needless to say I have vast experience with cameras and DSLR’s of all shapes and sizes. I shoot both Nikon and Canon and have all the standard array of top of the line lenses for both brands. While I always am using my full frame DSLR’s over the past few years for lots of projects, one area of interest I’ve been dedicating my spare time to is photographing the International Space Station as it flies overhead. It is visible to the naked eye at certain times just after dusk and just before dawn, and through apps you can predict when and where it will appear. It is by far the hardest thing I’ve ever tried to shoot... a bright white object against a black background moving at 17,000 mph across the sky. I’ve used all my zoom lenses, telescopes, more telescopes but it is hard to track with lots of extra gear and weight. I bought a P900 when it came out and was blown away at the capabilities of that camera. I never in a million years could imagine myself with a consumer brand Nikon CoolPix camera in my hand, but then again the CoolPix P900 did what none of my Professional Brand camera gear could do. However the main issue with the P900 and it’s 2000mm equivalent zoom is that it only shot jpeg and someone like me shoots exclusively in raw NEF format. It’s mandatory for me, but I settled in this case because its a trade off for the zoom factor.\nSo now the P1000 comes along, and not only have a much farther zoom capability, but this new model also shoots in Raw/NEF format! Oh the joy when I found out... and that’s not all, this new P1000 has MANY upgrades from the P900. It is from the Coolpx family which Nikon markets to everyday consumers and such, but the P1000 is different. It’s body is much bigger and sturdier than any other camera in the CoolPix line. It looks, feels, and pretty much performs like a higher end D750, except it has all the features that enable less experienced photographers take great pictures... things like scene mode, time lapses, it’s so user friendly but has all the manual functions a camera snob like me demands. I’ve seen guys in the field with those super high end telephoto lens that cost over 10k, but get you in close for wildlife and sports shooting... I always thought having gear like that’d never be possible, but the new P1000 truly changes the playing field, for everyone. Kind of like the iPhone did for photography, this camera opens the impossible up for everyone now.",
    "I have been wanting a high zoom camera for a long time. I almost bought the P900, but didn’t because of the lack of raw format. The P1000 looked to be just the thing. In the last couple months, I have been using it almost every day and it has renewed my interest in photography. While I love the zoom, there are a lot of things that took a back seat to achieving the incredible 125x zoom.\n\nPros\n• Crazy zoom. It can see things much farther than any lens I have owned. It has to be seen to appreciate how powerful the zoom is. You can’t buy an equivalent lens for anything close to the price of this camera.\n• Vibration reduction is very good. You can take good shots at high zoom and not have camera shake.\n• Very good pictures with low zoom and good lighting\n• Can take good pictures at high zoom, but requires work.\n• Raw format\n• Saves carrying around a lot of equipment. Even though this camera is a little bulky, it is far lighter than my DSLR and the lenses.\nCons\n• Sensor is too small for this camera.\n• Max zoom requires target to be at least 21 feet away to focus on.\n• Lens does not gather enough light\n• AF does not work that great. I have many of slightly out of focus images.\no AF frequently fails at high zoom and/or low light\no AF can take almost a second to search\no Not suitable for fast moving subjects. AF is just too slow.\n• Not suited for low light setting. Forget high speed photography in anything but bright light.\n• Not suited to high shutter speed. Images often are too dark and cannot be fixed.\no Higher zoom limits shutter speed.\n• Image quality can be unacceptably poor at high zoom\n• Digital zoom has no value. Every picture I have taken with digital zoom, I have deleted because of image quality\n• Many throw away pictures. A lot of out of focus or too dark pictures that cannot be fixed in Photoshop.\n• Not all modes take RAW format image,\n• Snapbridge is very poor. They should farm it out to a 3rd party.\n• No protection from rain\n• You have to wait for the camera to zoom. You cannot zoom manually.\n• No outlet charger included.\n• Nikon batteries are expensive.\n• Distance to subject for reasonable quality, close up is at most 150 feet.\n\nGeneral observations/notes\n• Requires tripod for high zoom videos.\n• Needs a carrying case.\n• I recommend purchasing a second battery and an outlet charger.\n• I use a monopod and have not used the flash yet.\n\nI have attached a close up of a camel in bright light, using a tripod at full zoom. This is typical of this camera and demonstrates the poor quality typical of full zoom. I have included a shot farther away as a reference.\n\nEDIT: DO NOT USE A UV FILTER, IT REDUCES THE IMAGE QUALITY SIGNIFICANTLY.",
    "I bought this camera specifically for it's long focal-length video capability and had my doubts about what it could actually do. I've spent a LOT of money of long glass over the years and have a 1000mm AF f8 sitting in a closet to prove it. The claim that this thing was good to 3000mm optical was hard to believe but intriguing. After a month or so of use I have to say the camera is radically good. But the thing I like best about it might not be an advantage to you.\n\nAt extreme focal lengths the effect of the atmosphere becomes more and more apparent. Images shimmer and in some circumstances the air seems to boil. I love using this thing to shoot video of things moving -- cars, people walking, traffic -- and at 3000mm on a hot day, the effect is very beautiful but odd. I set this thing up on a tripod in the middle of the street and point it down the road to where a freeway on-ramp is a mile and a half away, and can clearly see vehicles make the turn at that distance. All the vehicles -- cars, trucks, bicycles, and pedestrians -- are stacked up between the camera and the on-ramp and they're all moving under their own power as well as in the boiling air. It is a very theatrical view.\n.\nThis is probably not what you're looking for if you're doing bird photography or all sorts of other work. If you're working closer, the shimmer would presumably be less.\n\nThe autofocus works reasonably well although it struggles to get a lock at long focal-lengths. It is somewhat slow but will follow-focus fairly well. Images are sharp and clean even at the end of the zoom.\n\nThe P1000 does not have many of the controls or features found on professional video cameras but it has enough that I'm happy with it. It works for me as an extreme-zoom lens with a fairly simple video camera attached.\n\nMy two cents, your mileage may vary, opinions void where prohibited.",
    "Pictures are from my P900, I expect better from my new P1000\nI see here and on You Tube reviewers talking about the weight of the camera, If you're use to a camera this big or heavy, you're going to keep on it a tripod.. that's a waste of a great camera. Two years ago before I got the P900 I used a Canon D5 Mark II and with a 24-105 len it was just as heavy and that was my go to camera for weddings, portraits, for my special events, sporting (NHRA drag racing) NFL football and college football games, nature, landscapes and many places where I can't use a tripod. So far I like this camera, I think many camera users are good photographers, they could be great if they stay away from the auto setting much as possible with a good camera as the P1000, I still plan to use my P900 when it calls for it, but I love shooting in raw which you can't with the P900. And a tip to getting great zoom photographs is using a tripod when shooting between 500 mm to 3000 mm, you're find that the photographs will be much clearer using the proper settings on the camera, yes the camera has a great stabilization to help . Tip for some photographers,,,, if you just take snap shots, drop down to a lower model....no need to spend $$$$$.00 When I do more testing I'll come back with P1000 photos and further reviews. So far in this early stage I'll give it 10 thumbs up",
    "I ran into a slight problem, in that I received a reconditioned product, albeit it was in totally 100% mint condition. If I had known the reconditioned model would be in such perfect condition, I probably would have opted for that cheaper option in the first place. Contacted seller, and he quickly offered a partial refund to cover the difference and promised to honor the full year standard warranty, if I should need that, (reconditioned models only offer 90 days). So I got a practically brand new product for cheaper, and coustomer service was quick, painless and a pleasure to deal with.\n\nThe camera itself is awesome. Zoom is unbelievable! While I'm not at all a professional it was pretty straightforward to use auto, point and shoot. Your going to want a tripod, but even without one, just resting my arms ok porch railing, I was able to get some stunning shots of the full moon last night. I'll get some shots of other things and upload a few of the best at some point. There are lots of features and I honestly haven't even really begun to figure them all out, but it's not too complicated, just gonna have to use auto whilst I overcome the learning curve. I don't expect to encounter many other observable curves on this p1000 journey, but I'm looking forward to collecting more and more first hand observations with this bad boy. Not supper cheap, but quality is too notch, you get what you pay for and in this case I'd say it's definitely worth it. Cheers",
    "I am so disappointed that I am writing this review. I just got home from the UPS store where I returned my new camera. Before ordering it I viewed all of the YouTube videos and the Nikon sales pitches. And I was sold. It looked amazing and I had been anticipating its arrival for weeks. Until I took it out of the box. It's huge. Not just big. HUGE. Cartoonish huge. It actually reminded me of my dad's camcorder from the 70s. The ones you had to mount on your shoulder. Obviously I was willing to accept it's size and wanted to see what it could do. I was smart enough to know that I would need a monopod to help me stabilize the camera, but it wasn't enough. I had a VERY difficult time keeping the lens on my subject when using the telephoto. I knew that it would be hard, but it was frustratingly difficult; to the point that I just started taking random pictures hoping that some of them would be framed properly.\n\nThe goods news: it does take great pictures. You just have to be able to deal with walking around with a five pound ham with a five foot stick poking out of it!\n\nJust fyi I have been taking photos for 59 years so I know a little about working a camera. I really am disappointed to be saying this. I wanted to give it five stars and rave about it, but I just can't. The other goods news is that I have another Nikon with three interchangeable lens so it looks like I'm sticking with that!\n\nAdditional comments after this was posted:\n\nWhy are so many of you taking this personally? I didn't attack your mother. I just was disappointed in this camera because it is too large and I don't want to always have to have a tripod or monopod when I'm shooting. It's not a bad camera. That's why I did not give it one or two stars. But I don't recommend it so I gave it 3 stars. It's my opinion. That's what these posts are supposed to be right?\n\nBy the way, that was really ignorant to say that I'm too old and weak for a big boy camera. I am not, but what if I was. What if I was 80 years old with multiple sclerosis? Would I be entitled to the opinion that this camera does not work for me? I get the feeling that you need to measure your manliness and virility by the size of your lens. Interesting.",
    "Camera seems fine, although has some lag with the auto focus. Initially thought I was sent an \"open box\" as the box was not sealed, manual was not in a plastic sleeve and the lens cap was also not wrapped. After reviewing some unboxing videos on YouTube, I think this is the way they're shipping them now. I would definitely prefer a seal on the box, better wrapping of the actual camera, and the manuals in plastic as they were rattling around in the box and made it sound like something was broken before I opened it. But it seems \"ok\" so far.",
    "I started taking pictures around 1970 with a Kodak Instamatic camera, which I still own, using 126 cartridge films. I now own several cameras; most of them are Nikon cameras. Every camera I own has its pros and cons. I'm not going to go through all the same things other reviewers have posted. I didn't buy this camera thinking I would get the same quality images I get from my Nikon D750 with a Nikon AF-S FX NIKKOR 24-70mm f/2.8E ED Vibration Reduction Zoom Lens. I bought the Nikon P1000 for all the pleasure I get from using it, sometimes I get good images and sometimes bad ones, as with most any camera. For the most part, the images I get from the P1000 have been very good. Yes, it’s a big camera for a point and shoot but when its gets heavy I put it down. When it’s raining I don’t take it out to play, probably would be very careful at the beach because of sand and water. I saw a squirrel in the woods the other day and with the 3000mm zoom I got some great pictures without scaring him off. What I’m trying to say is, if you can talk your wife into another new toy (a really great wife) and you have the money, buy the P1000, It’s a lot of fun. I have owned the Nikon P1000 for\n\n1 Year; I'm still enjoying taking pictures with my Nikon P1000. I carry it in my car all the time, won't fit in my pocket like my cell phone. All the pictures shown are taken hand held including the moon. So far no problems with camera. Wife still questions the purchase :)) , but she likes all the pictures. This camera was purchased for fun and the interesting photos you can get with it.",
    "I have owned the Nikon P900 since they came out, and just received a P1000. I love the new P1000. Interestingly, I don't think the 3000mm maximum zoom is my favorite thing about it. Besides the obvious new features -- like the hot shoe, ability to use an external microphone, great eye-level viewfinder, and RAW shooting -- I really like the new control ring on the lens, which is very handy for manual focusing (especially with the new switch for quickly going from auto to manual focus). And the autofocus seems faster and more accurate. Lots of other new features that I am still learning to use but think will be very nice. And the menu system is much improved. This is a far better camera overall than the P900.\n\nYes, the P1000 is significantly larger and heavier than the P900, but it is not as heavy as a normal DSLR with a long lens. Neither the size or weight has been a problem. In fact, I think the extra weight (along with the larger grip) makes the P1000 more stable and less subject to shaking. All the attached photos were handheld and taken from a small boat. However, having said that, if they came out with a new version of the P900 that had the 2000mm lens but added all the other new features of the P1000, it would be a tough choice of which one I would prefer.\n\nBut in general, if you own a P900 and are wondering if you should upgrade to the P1000, I say go for it! So far, my only complaint is that the battery doesn't last as long as it does on the P900, so buy at least one extra battery.\n\nI'm looking into buying a dot sight to use for taking wildlife photos. Nikon is coming out with one, but my understanding is that any dot sight should work, and the Olympus EE-1 looks like a good choice. It has good reviews and is cheaper than the Nikon one (and is available now). Does anyone have experience with this?",
    "I am adding to my review below. It's been One year in a half of ownership. I see these guys all around with these slr's with HUGE lenses and a fraction of the power and feel sorry for them. I GET THE SHOT WAY OUT THERE! I'm still impressed with the quality. If Nikon produces one with 24mp I'll spend another grand and so forth on another one.\nBattery life nearly all day.\nSPEND MONEY on the fastest SD card possible. You won't regret it!\n(Original review)\nI am really impressed with\nthis camera. Not really heavy and not as bulky as I thought it would be. As a matter of fact I feel as though it is very lightweight. I'm finding I have better control with this size camera. The zoom lens is awesome! Does very well getting closer shots at reasonable distances. Very long distances does come with some atmospheric blur as expected. No fault to the camera however. One thing I am critical of is that I feel that Nikon could have upgraded the megapixel to make the image quality or comprable to a DSLR. That is why I only give image quality a 4-star rating. Many improvements. When I use the camera on burst mode all the images come out in perfect Focus. My p900 very much fell short this. I like the control ring around the lens of the camera. Can easily dial in features and especially exposure. I like that I can brighten and darken an image very quickly before taking the photo. I think this is a fantastic and easy camera for someone who is amateur like myself and works very well on automatic mode 4 nearly all scenes. I certainly recommend this camera to anyone who is looking for great quality and and extremely large Zoom range. I am extremely pleased with this purchase!",
    "I have own many Nikon cameras (and even some Canons) including the D850. I have purchased telephoto lenses for these DSLRs with disappointing results in their reach. This has been solved by a camera which costs a third of any of these telephoto lenses which would mount on my D850. The camera has the feel of DSLR but has a reach way beyond anything I have ever used before. The photographs are sharp and crop with clarity. I am amazed this camera is not priced more. Although this might not be the easiest camera to carry around during a trip, it will definitely be the best camera especially if you are planning on photographing landscape, animals or even sporting events, this is a camera which will give you some of the best photos you have ever taken. I would recommend using a tripod if you plan to use it at the extreme focal length. Otherwise this camera can easily be used handheld if you can handle the weight of a DSLR. I consider this camera one of the best buys I have made in photography over the last five years. Better than upgrading from the D750 to D850. This camera allows me to photograph objects I only dreamed about in the past since they were beyond the reach of my equipment/location. I now carry this camera with me instead of a $3000 to $4000 telephoto lens which does not even come close to this 3000 mm P1000 camera. If I need a zoom, I pull out this camera and keep a standard lens on my D850. The combination makes it possible for me to photograph anything, anywhere. Outstanding camera from its sensor to its lens. Can not imagine photography without this camera.",
    "I was so excited to read reviews on this camera and the zoom capabilities listed. Two months in and the wifi connection to SnapBridge doesn’t function. I’ve tried every troubleshoot technique available. I am returning and wish I had read reviews on Reddit before purchasing. It appears there are defects with Nikon software. I have a canon camera and have no issues with connecting to wifi to download pictures. One other issue is the camera gets out of focus too easily. I see other reviews mention this. What good is a zoom lens when you can’t focus on your subject?",
    "So much time still learn on this camera but I love everything so far! Just make sure you get a American version and not a international version!!!!",
    "Since the user manual is printed in such small print I've got the pdf version up on my 55 inch monitor+ there are many getting started videos on the internet. Taking baby steps and will revisit this review in awhile after hands on use.",
    "I've had this camera for two days now and have worked thru the 175-page manual, so I feel safe posting some initial thoughts. First impression: it's BIG, and it's heavy. It is half-again bigger and heavier than my Lumix GH-4. But the Lumix doesn't have a 3000 mm zoom lens, which is the Nikon's raison d'être. And that is where it shines. The sensor is small but the pictures are sharp. 24 mm wide angle and 3000 mm tele both produce nice images. (The photos I uploaded are 24, 1000, 2000, and 3000 mm, -- straight out of the camera. No tripod, just laying on a table, so the 3000 isn't as sharp as it could/should be.)\n\nThe menus are easy to navigate. The menu options are much more limited than the DH-4 but the most-used features are there, and are easily accessible. I would like to have more than one \"Fn\" button for quick access to menu items, but that's a small nit. There are physical buttons for exposure compensation, self-timer, focus mode, and flash settings. The manual focus works very easily, and I found it really handy at the long zoom settings. Overall, it's well done, with obvious design sacrifices for the enormous zoom range. I'm sure my DH-4 will remain my primary camera, but this Nikon seems to fulfill its main purpose quite well. (I took one star off for its bulk)\n\nSide note -- I'm not sure most people will find the extra zoom power over the earlier P900, which has a 2000mm tele, worth the several hundred dollar premium for the P1000. Plus the 1000 weighs an extra pound or so. What swung it for me was the RAW capabilities of the P1000, plus a few other features that a lot of folks might not care about.",
    "Many have complained of this camera being heavy. I've taken it out to take photos and enjoy the lesser weight than that of a 500mm or 600mm lens attached to a Nikon D7100 and get tremendously closer photos than I could with either of those lenses. The image stabilization works very well but you should still use a tripod when zooming out to the limits for a better shot. Remember to turn the stabilization off when using the tri-pod. The mechanics in the lens can cause motion even when on a tripod.\n\nI have taken amazing photos of the moon. At full extension of the lens, you only get a part of the moon. Craters are crisp and there are more visible than I had ever gotten with a large detachable lens. Have taken close shots and still be in focus that I never would have thought possible . It has a macro selection but it won't be needed unless you get extremely close.\n\nThere are some downers, i.e. total pixels and small sensor. Still, I have taken excellent photos with other cameras that were the same. The main reason I didn't like 16 mp was taking shots of birds that usually were a great distance away. This required cropping the photo which decreased the size of the file. With the P1000, no cropping is necessary for those distant birds. As a birder, this is a grand plus for me. Also, not having to change lenses for each situation is handy.\n\nEveryone has their own idea of what is ideal in a camera and lens. The P1000 fills a spot for the type of photography I do - wild birds and animals. One camera covers all situations.",
    "At long focal lengths, the P1000 gets much better pictures than a P900.\n\nUsing a tripod I got the attached sequence of a cormorant who was basking in the sun using purely optical telephoto at 24mm, 275mm, 3000mm. Using combined optical and electronic telephoto, on a tripod, I attach shots at 3600mm. 6000mm, 12000mm. I have a feeling that electronic telephoto is largely done by cropping.\n\nHand held, I attach pictures of a heron at 1000mm, a cormorant swimming at 2000mm and at 3000mm, all within about 200 feet of the camera. I also attach a hand held picture of a far subject, namely a cupola that was about 1500 feet away, at 3600mm. These were hand held without any support like a fence or a tree.\n\nSo this is a very capable camera, both on a tripod and, owing to good image stabilization, hand held.\n\nBattery life ? So far I have taken 291 pix, with lots of zooming in and out, and the battery indicator is now showing half depleted.\n\nAs backup for long trips I purchased two spare batteries and a charger for $18 (Powerextra 2x EN-EL20a Replacement Battery & Car Charger Compatible with Nikon Coolpix P1000). The charger also plugs into a 110 volt wall socket. Average review was 4.4 stars but several users warned that these batteries don't last all that long, so I'm going to keep the OEM battery in my camera bag and use the cheapies and see how well they do.\n\nTo protect the camera I bought an Amazon basics medium size camera bag which fits well, though would not protect against major impacts.",
    "These pictures are not the highest possible resolution for the camera. I'm having a great time with the P1000\nAlthough I had to have it replaced once, Amazon service was amazing. Shoot raw and the lower resolution of the camera is not an issue for me. JPEG only does not do what I enjoy, although is probably more than enough resolution for general posting sizes on line.\nThe \"digital extended zoom range is an issue and interesting. I have not used it enough to speak to it, beyond saying it may be an issue. My first one did not work at all. The replacement works fine, and works a little differently than the full manual suggests. First, be ready to select 'RESET TO FACTORY SETTINGS\" on the menu, even right out of the box, to get the digital zoom activated. Then, it is, as designed, available in some and not all shooting modes. The manual says \"not in bird mode,\" yet mine does have digital zoom access in Bird mode. I have not decided if it is a useful feature or not. The lens itself, autofocus, features of the camera, etc., are really fun! Buttons are well-located. I suggest ordering an extra battery or two, along with the quick charger. Otherwise, out of the box, charging is only while in the camera. The five stops of optical image stabilization is astounding. While a tripod with stabilizing off is nice, hand held and braced with stabilizing on is astonishing. I would buy this camera again.",
    "i got this camera last year, almost as an impulse buy - though i did watch a bunch of videos talking about it.\n\ni like this camera a lot, i have taken literally thousands of photos with it. its a professional looking point-n-shoot camera, and it does exactly what it says on the box. it takes really good photos most of the time, but i find that its hard to control everything.\n\nthe zoom is great. just not fun when on a tripod and you dont have a lens stabilizer. mine always falls down due to the weight. but when i get it work on the tripod, it takes amazing photos - especially of the moon. i also like to use it when taking photos of birds - i never have to get too close, but i find that the camera is a bit slow when the animals are moving.\n\ni like the camera, and ive had fun with it taking all my photos. ive recently upgraded though, and i feel like the p1000 will be on the shelf for a little bit before it sees use again.",
    "Clearly the zoom lens is the best feature. In my photo series you can see the ability to zoom in on a target well over 1KM away. You can almost read the brand of sunglasses the boat driver is wearing. The image stabilization is excellent. I also owned the Nikon P-900. Also an excellent camera. If Nikon releases an update to this camera I will buy it immediately.",
    "Unbelievable reach with its 3000mm lens. Persons will have trouble holding the camera still enough at max. range to avoid a slightly fuzzy picture in many cases. However it can be done with some practice. Great 4k vids and pics. Wonderful feel when holding this slightly larger than normal camera. Its heft and weight, however, I find are useful assets when filming at lens max. If you own a P900, you might want to think twice about this camera, however. The two are much too similar in most features. If you did not get a P900 because RAW was not included as part of that camera, this one has RAW for you purists. It is not an \"everything for every Photographer\" camera, but then, what camera is?? It is a Bridge Camera, not a DSLR, so you have both the advantages and disadvantages of that you get, and give up, in going to a Bridge Camera. If you do a lot of Nature Photography, or just live where you get to see a lot of nature out your back door, this is the camera for you!!! You will get those long distance pics of Mother Nature at her best that you would miss with another camera. And while I do wish it had better battery life, when out in Nature, that little failing is not enough to dampen my enthusiasm for this camera. I do recommend this camera.",
    "This is not a bad camera, true the pictures aren't all that good (16 MP ) at max zoom the photos are blurry. Now, the video capacity are outstanding. You won't find a better video camera unless you buy a professional camera ( thousands of $$$).\nI had to return mine because after I spent all that money, I got an open box ( or returned) camera.\nI'm kind of disappointed with Amazon.com because they are not doing a better job screening the sellers, this is becoming a \"flea market \". From now on ( after 20 years with Amazon) I will buy electronics from my local seller, that way I know I'm getting a brand new item.\nSo if you are looking for a good video camera, this is it ( pictures so, so )...\nThank you for reading.",
    "At first I was a little unsure about the weight and size, but after using it a few times and learning different settings, I love it. We mostly go birding and nature viewing. This is a great camera if you are taking a lot of variety of pictures from closeups of flowers, to family shots, to scenes and birds and animals and don’t want to have to change lenses. It has a specific bird setting that works fantastic for capturing birds in trees and brush. The sports setting also worked great for capturing pictures of dolphins on a boat tour. The smart image setting is great as well. It isn’t super fast at recovering for the next picture after taking a picture, especially after videos or multiple shots. I have a smaller camera I take places when I don’t need the super zoom as it is quite bulky and heavy.",
    "This is my first take on the Nikon Coolpix P1000 camera. I'm an average novice photographer. Love taking pictures without putting a lot of major thought into it. The Nikon Coolpix P1000 has opened doors I never thought possible for me. As with all new cameras there's a learning curve but this one seems less than others.\n\nPROS: Love it! Despite being a bit on the heavy side( 3lbs 1.9 oz) the rewards are worth it. The pictures posted show why. Both were taken without a tripod. For the moonshot I used a porch post to lean against to stabilize the camera. Improvise..Adapt..Overcome!\n\nAs seen in the far right picture, the P1000 is about 1.5 times bigger than my D5500 with the Tamron 18mm-400mm lens.\n\nCONS: The camera didn't come with a separate wall charger. You have to charge the battery in the camera itself with the charger adapter kit provided. The battery is removeable and sits next to the SD card slot on the bottom of the camera.\n\nI am not sure someone with small hands could hold this camera comfortably and would most likely have to resort to a monopod or tripod. I'm a big guy so it was no problem.\nIt is a bit on the pricey side but aren't you worth it? You can't put a price on the fun you'll have with this great camera..",
    "If you are looking into this camera it is probably because of the 3000mm built-in zoom and macro capability. I have used this camera on a couple of big trips-The Galapagos Islands and a recent Italy & Greece trip. I have found that it really beats carrying around extra lenses. The weight is tolerable for a full day of shooting if you support the camera when not taking pictures or else use a shoulder strap.\nWhile the extreme zoom can present problems with noise and framing issues under cloudy or gray conditions, it is excellent on a clear, sunny day. The photos I have attached of the Hephaestus Temple that I shot while descending the Acropolis, are a good example of this cameras zoom capability on a perfect day. Except for reducing these images in size for the web, they are not re-touched. I find this camera to be a great solution for people who don't want to carry a lot of equipment.",
    "I bought my last Nikon camera ten years ago. I bought this one because I wanted better moon photos. When I extended the lens all the way to 3000 mm on my original tripod, the tripod almost went face-first onto the ground. (I fixed that problem with a new Manfrotto tripod.) Once you have the right tripod, or you have extremely steady hands, your moon pictures will be the envy of the neighborhood. The next morning, if you want to take close-up pictures of your flowers, you'll use this camera in macro mode at 1 centimeter away. Purists will say you could have a bigger sensor, or more lens control, or blah blah blah. Tell them to go jump in the lake. This is a \"bridge camera;\" it delivers superb pictures up close, and it delivers mind-blowing moon pictures, all without stopping to change lenses. P.S.: I also record training videos with this camera. Did I mention it can record at 1080 resolution and in 4K resolution? I added an Audio-Technica shotgun mike to the accessory shoe on the camera, to record my granddaughter's orchestra concerts. Stop reading, and buy your own Nikon Coolpix P1000. You'll be glad you did.",
    "no review",
    "Wow, the zoom; it is incredible. And the EVF is really nice, bright and sharp. I think that about sums up the pros. I have to say that I really wanted to like this camera, I really did. I knew that it was large and heavy, and it is, but I knew that going into it. The two deal killers for me, and the reasons I ended up sending it back, is because the AF is super inconsistent beyond 1500 mm and the image quality beyond 1500 mm degraded quite a bit. The images at 3000 mm is more useful for snap shots or memory sakes but they wasn't anything I'd consider printing or hanging up.\n\nWhenever I started zooming out, the AF failed quite a bit and I had to switch to manual focusing, and this isn't very helpful if the target moves much. To make matters worse the manual focusing ring was slow to adjust the focus. I could almost live with this if the image quality was good that far out, but it wasn't and that was the biggest disappointment. All that zoom is wasted if the images aren't satisfactory.\n\nI had the P900 before and I think it was a better camera. The main reasons I wanted this camera was the extra 1000 mm of zoom and the hot shoe, but the P900 just took better pictures.",
    "just love the zoom",
    "I have used it for a couple months now and it is mostly great. It does shake a lot at higher zoom levels even with rock steady quality tripod. And it is not weather sealed, so it is unknown how long it will last with extended outdoor use. Also, the left channel stopped working on the external mic 3.5mm input after only a couple months. Make sure to save your warranty card and register it online.",
    "I'm very much an amateur, and pretty right-brained, so I can't get into the fine specs of this camera. I just know I bought it for nature photography, mostly birds. I had heard that my P900 could get an image of the rings of Saturn, but I ended up accomplishing it with this camera instead. I looked around online and everyone seemed to say the sensor is too small, but I took this photo of Saturn two nights ago. It was not edited in any way after shooting, except for cropping. I used the optical zoom only. I didn't use stacking software or a tracking mount. I don't know much about astrophotography. I just put it on a secure tripod, zoomed in on Saturn, and tried a lot of different lengths of exposure. You can do a lot with a camera that can get you this close to objects this far away. I tried looking through two telescopes a few weeks ago, but objects looked distant compared to what I see through this camera. If zoom is your thing, this is your camera.",
    "The weight was a little surprising but nothing that can't be handled. I even took pics at 70 miles on hour that came out pretty well. We do hand held but a tripod would certainly be good for sure. I put a uv filter on to protect the lens. However, I first put a cpl lens 'cause I read somewhere that would be a good thing to do. Don't do it. It restricted the lens from reaching 3000mm. I almost sent it back until I figured out my error. I like the camera. It's a little pricey for this old lady but it was just one of those whimsies and I am not looking back. It does take a very nice picture. If you want to get across that field without changing lens all the time this will be the one.",
    "The media could not be loaded.\nIs it BIG? YES!!! Is it HEAVY? YES!!! BUT is it AMAZING? Hell YES!!! I just got it two days ago and I’m an amateur photographer, so I still haven’t played much with it to open all that it can do. But so far the picture quality and zoom capability are well worth every penny. Plus I love the eye sensor on the view finder. It automatically switches you from screen view to eye view by just placing your eye on it. And it switches back when you pull away. Sorry the video is a bit shaky. I bought a tripod as well but I was way too excited to waste time getting it and mounting the camera on. Still, I managed to get a great shot and video of the crescent moon. Can’t wait to learn more about what this camera can do. I’m a very happy customer right now!!!",
    "Some what of a learning curve but not a problem. More settings to use and getting use to how heavy it is when the lens is extended fully and hold it steady enough to get a good photo. I'm taking a tripod with me more then I did with the p900 but being connected to the cell phone as a remote shudder button helps out quite a bit. At some point I will have to find a better tripod to use for planets. The head on my tripod moves to much. I've had about a month now. I take it hiking biking and will take it kayaking this coming spring. It's a good walking around camera if you have a good sling strap I use rapid strap. Next year I will switch to a vest while hiking to carry the heavy camera. It takes nice photos but you'll have to edit them if you want better then just nice photos.",
    "I've been using this for about 4 months now. Good fun easy camera to use. I don't want to repeat all the great things about its zoom. This would make a great webcam for online streaming using an HDMI capture device to your PC. BUT, the CLEAN HDMI output shuts off after 30 minutes. For this use I don't need to record for more than 30 minutes but just want to keep the live video streaming out the HDMI port. I contacted Nikon on this and they were no help. Still, a great camera.",
    "I finally received my long awaited camera. I used to have a Nikon P900 so I'm not really new to this gadget. Controls are somewhat similar but a little heavier, bigger, pricier and very imposing whenever you're holding onto it. The camera itself is amazing, 4k is a great addition, raw image is a wish came true. I hope Nikon just throw in the remote and camera case for free to truly enjoy this camera since it's really big and heavy.\n\nIf you're looking for an expensive powerful monocular, just buy this and you're a winner. Nothing can beat the zoom power capability of this camera. Plus you can shoot and record photos and videos of your objects.\n\nI'm hungry for accessories especially the remote control and camera case before I can carry this beast to outdoors and see the full potentials of it. But until then, I still have to worry paying off my credit card which I used to purchase this camera. You'll hear from me soon!",
    "I bought this camera about 3 months ago. The zoom is crazy good. It is a lot of camera to carry around, but think how long a telephoto lens would be to add to a normal DLSR. I have another Nikon that is not telephoto. Bottom line is if you need a telephoto, buy this one. For a telephoto camera, it is a small package. For a normal DLSR, this would be on the bigger side for you. This camera uses mechanical zoom, not the digital zoom that loses picture quality. The only disappointment to me was on the specs as far as not being a higher resolution, but then again, a higher resolution that uses software to zoom in loses picture quality.",
    "Pros: Awesome zoom. Lightweight. No need to carry my large lenses anymore. Ease of use. Easily adaptable. Customizable options. Purchased less than MSRP-so three dollars less but compared to the current pricing on Amazon and EBay.\nCons: still looking for them. I will update at a later time.",
    "Never been into photography but retired and moved to the coast so I researched my options for filming wildlife and made a decision to buy this. I am amazed at the ease of use! I’ve been able to get some awesome shots of whales, birds and ocean views.\nI’m sure as I practice I will enjoy this camera even more.\nI do feel they should of included a memory card. Like buying a new car and not able to drive it because the tires are optional. I was disappointed that I had to make a trip to town before I could use the camera. Another disappointment is my remote hasn’t arrived yet. This also shouldn’t be an option in my opinion. I would have gladly paid more to get a complete camera.",
    "I’ve been shooting Nikon DX DSLR for almost as long as I can remember, I was truly intrigued with this bridge camera concept. Being Nikon, the build quality is exceptional and the focal length and zoom are stunning quite frankly but at the end of the day that kind of power is a niche and I just don’t think I would use it often enough to warrant having such a big, heavy camera for everything else.\n\nI took some truly amazing photos of the moon from my balcony but seriously how often am I going to want to do that? I honestly think I’ll be much happier with a more traditional DSLR, like the D7500.",
    "what can be said, this is a large camera that can reach places that other cameras can never get to. Its not small like my sony a6000 but to get that reach you need big. I did the shoot the moon thing right away and after years of trying to do that, I finally did and with ease. So, impress all the people you know, let them look at you zoomong at far far away places and only dream they can do that.",
    "I bought this camera for the zoom, as most do. I had been using a lumix fz1000 and my intention for this nikon was to reach where the lumix couldn't.. the nikon has blown me away, and pretty much established itself as my favorite. The hawk in this picture is from 30 yards. The goose in the second picture, is also in the middle of the third picture; down the canyon and in the river. I take this camera everywhere.",
    "So far I’m very impressed. I was scared a bit by reviews talking about large and heavy. Coming from Canon EOS 5D Mark II, with lenses and other accessories - this one is a feather.\n\nYou can’t expect this extreme zoom capability in pocket size. Maybe in a few decades? Maybe never.\n\nDo NOT buy a circular polarizer. The focus doesn’t work with such a filter - especially not when zoomed in.\n\nWhat I do find less than optimum, though, is the tripod mount. It’s located at the center of the camera house. You need a very strong tripod because the camera tilts forward, as the lens moves the camera center of gravity much further forward. The mount on the camera should have been further forward. Now I need add an extension plate between the camera and tripod, to obtain a decent balance.",
    "We are having a great time with this camera. We use it mostly for bird pictures where we want more options than our high end point and shoot gives us. The Coolpix has a bird setting but for some reason this setting doesn't allow for RAW images and the color settings are different from other modes, so I set up the Program mode to match the Bird settings, leaving the color settings alone and turning on RAW. This allows me to take some great bird photos and edit the RAW images as needed. We also use it for photographing my wife's art work. Works extremely well for this as well.",
    "I use this for surveillance, mostly. It's an amazing tool! I do wish that it was lighter, but I can't get this kind of zoom with anything comparably sized... So I keep that in perspective.\nOne feature that this unit doesn't have that I liked about the p900 is GPS. I do keep it connected to my smart phone, so I just make sure it's actually updating the location.\n\nThe manual switch is a huge advantage! So is the focus ring! When I'm taking video through trees, etc., I just have to keep the focus on my subject and I don't have to worry about wiggling leaves or swaying branches to take it out of focus. They move I just adjust the ring.\nGreat job, Nikon! Now hurry up and get that remote to me for this thing!!!",
    "It's without peer for distance wildlife photography. Image stabilization is better than what the p-900 offered, zoom is about 30% better, which is more than you might think, takes RAW and JPEG images, the 4k movies are impressive for sports and other subjects. The P-900 sensor is wired from the front, reducing image quality and sensitivity. The p-1000's sensor is wired from the back, and it takes better pictures than the p-900, though it operates at the same resolution. The equivalent zoom in a dslr would run more than $20k, and weigh enough to make hiking around with it impossible without a safari. I can get shots with this camera of things I could formerly see only with a spotting scope. Small sample of images below.",
    "The P100 is a fantastic camera for anyone who enjoys taking nature photos. Is is a bit hefty compared to a \"pocket-sized\" point and shoot, but it is much lighter than a camera and a 600mm lens. It is also a lot cheaper! The image quality may not be as good; however, it is more than adaquate for the average \"hobby\" photographer. The bald eagle in the included photo was more than 300 yards away and the image is still very sharp. This camera is also great for sporting events and concerts where cameras with seperate lenes are often not allowed. I also own a P900, which I thought was amazing until I purchased its \"big brother\". Now it sits in its case most of the time.",
    "Yes, the sensor is small but you don't have to degrade your images by cropping and enlarging them either. It all evens out. If you know anything about digital cameras, you know that a small image sensor is necessary to achieve large amounts of optical zoom in small packages. Small packages you say? Yes, for a 3000mm equivalent focal length this camera is not that big and it is definitely not heavy. The P1000 is about the same size as my Nikon D810 with a 24-120mm lens but weighs less. They are different tools for different jobs and the P1000 does its job very well.",
    "IT is a fun camera for long range as nothing can really get you that close. For that, I enjoy it BUT you must adjust your expectations. The sensor is VERY small. Smaller than the main sensors on many high end phones. Testing its wide end performance vs my Mate 20x, the Mate 20x blew it out of the water in detail. The P1000 has that watercolor look to the photo.\nWhen going up to around 2000mm it still looks good enough for your normal IG, FB posting. RAW helps you get more out of the image if you know how to handle RAW files. After 2000mm the aperture drops into diffraction territory and by F8 (3000mm) it is heavily affected by diffraction give images a pretty soft look. You can of course work on them and get decent results for smaller social medial sharing but dont expect beautiful images you can pixel peep.\nSo adjust your expectations and you may have fun with it.",
    "I have a older Panasonic Lumix DMC-FZ28, which has reached it end. It had so many functions and choices to shoot photos I became spoiled. Then I got the Nikon Cool Pix P1000, I was amazed at how heavy it was at first. Then noticed that a carrying case want not something it came with to protect the camera's body, as the Lumix had done. Also, the Lumix lens cover was attached to the camera, but the Nikon isn't. So, remember where you put it. I find the Lumix can focus better and faster for better images. But the amazing part of the Nikon is the power of the lens. A tripod is needed for attempting to take pictures of the moon. The camera shutter is slow in its reaction time when taking many night time photos. Would like to see a future camera with more of a combination of the features of the Lumix, with the lens of the Nikon.",
    "Point and shoot user here. Took this photo of the conjunction of Jupiter and Saturn last night from my yard. Imagine my surprise when I was told those objects are some of the moons of Jupiter!",
    "OMG. What a camera. Took awesome handheld pictures zoomed in on the moon one night that were phenomenal. Like a telescope more than a camera. It is very heavy but no more than a DSLR with same focal length lens. Don't understand why they can't make the lens cap with a small hole to attach a strap. The type with adhesive doesn't hold. This camera also needs a longer strap on the lens cap. Due to being heavy I plan to buy a padded strap for the camera as it gets real heavy around the neck and the strap is narrow & uncomfortable. Camera all by itself is beyond words!",
    "Wow what can I say, I like it of coarse it does not have the quality of my full frame Nikon 800E DSLR but for a point and shoot with 3000mm and great image stabilizer ready to shoot when powered on I’m liking it. Picture quality is good don’t get me wrong, better then a cell phone because the optics are better. I can’t get shots with my 300mm Nikor on my DSLR that this camera can do easy. I’ve used this to take pictures of SANDHILL cranes in auto mode.",
    "Love this camera. I am not a professional so can’t help with all the tech talk. But after reading a lot of reviews and watching a lot of reviews the main con most had was the quality of the image. I am quite happy with the pictures I have taken so far and am sure I will continue to enjoy it.",
    "This has really helped with shorebird identification. I use this camera instead of a spotting scope. The zoom is really a game changer in being able see and identify at a distance. Impressive stabilization. The quality isn't going to be the same as a 45 megapixel Sony, but if you're shooting things at a distance, you'll actually be able to get the shot.",
    "When I have to zoom out a bit to capture the moon, I know it has an acceptable reach.\n\nVery fun camera, I use it more than my DSLRs and it completely replaces my canon sx60hs - no looking back.\nThat said it is ENORMOUS compared to the sx60hs.\n\nThis has a better user interface. Quick access to manual focus, with a manual focus ring. That sure overcomes the hunting problems of my previous superzoom.\n\nDedicated moon and birdwatching modes... (are users that predictable?)\n\nOnly (small) nit is it blanks the viewfinder after taking some pictures (why?)",
    "What can I say about the zoom capability of the Nikon Coolpix P1000 except that it's PHENOMENAL. The first thing you'll shoot is the moon since you've never been able to do that to your satisfaction. (Okay, maybe YOU could but I never quite did it right.) The \"Moon\" mode enables crisp and breathtaking images when the camera's been mounted on a tripod (a must do). And if you're a birder - - wow; have fun. If you're not a birder, you'll find a reason to become one just to push this camera to its maximum capability.",
    "It is much better than my P900. I am getting great shots of animals 300- 500 yards away. I do recommend setting the contrast and saturation higher. It does lack in the pixel department. I remedy that in my editing department.",
    "I love this camera, still a little shaky on some zoom shots but I suspect that has more to do with my tripod than the camera. I have a new heavier one to try. So far worth every penny.",
    "I'm coming from a Canon Rebel T3 (crop DSLR). This camera is amazing for a hobbyist wildlife photographer. To have a lens with this kind of reach without spending $10,000 is awesome. The flexibility is great and not having to haul a bunch of lenses with you is very convenient.\n\nThe auto focus is definitely lacking and it's not going to compare to a full frame DSLR in low light performance or clarity, but you can definitely produce some wall hang worthy photos with this camera.",
    "Great camera but the image censor could be better. Zoom is amazing, take excellent moon shots, birds and other far shots.\n\nIf you wanted to spy on that cute girl from a mile away you can and no one would know.",
    "I've owned a lot of \"oddball\" cameras in my days, but this one is by far the most fun and takes excellent pictures. I replaced my P900 with this, for the new zoom level and RAW, and boy am I glad (so is my wife, she got my p900!). This is fantastic for astrophotography, landscapes, wildlife, basically anything where zoom and crystal clear imaging is helpful. Would definitely recommend to anyone looking for a super zoom camera without a superzoom priced lens!",
    "The p1000 is a great camera, I have the p900 and other cameras, most are Nikon. I pre-ordered the camera and was quite eager to receive it. I have taken hundreds of pictures with it and I am pleased with the results. A few of the pictures were not as sharp as possible with a d850 and a $6000.00 lens. I have taken photos of distant objects and wildlife. The camera has also been used for macro photography. In my opinion the camera was worth the wait and worth the price.",
    "It's only 16 megapixels but it has a good sized image sensor capturing great detail. A truly versatile camera. It is huge so a good quality tripod and camera bag or backpack is recommended. You are not going to want to wear this camera around your neck for any length of time.",
    "Absolutely amazing, great picture quality! Super Zoom! Lots of features! Strap is ok, I'm getting a better one. Camera is heavier and the stap kind of digs into your neck a little",
    "24mm - 3000mm is kind of outrageous and fun. Two things I have learned about this camera that might help. I only shoot it in raw for long lens photos, and after not getting a few photographs in focus I removed the uv filter, now this is a great camera for bird portraits, and I've set it up with the user U profile and don't use the icons on the selection dial.",
    "I love this camera--it takes a good, wide angle, but, still zooms in great!",
    "Greate zoom, good pictures! However, CCD could be a little bit bigger to be perfect.",
    "I photograph native birds and the zoom range is awesome! I also own a Nikon P900 with a 2000mm zoom range, but the P1000 with it's 3000mm zoom is just what I needed. The only feature I am not too thrilled about is the write speed to the SD card, but this only happens after I shoot off photos in continueous mode (Bird mode).",
    "The biggest and heaviest Camera You probably going to hold in you Hands\nWhen you zoom in it’s hard to focus but it’s very fun to get very close to see the moon and different subject",
    "The zoom on this thing is incredible and even after watching all the youtube videos and reviews I was still blown away seeing it in person. Having said that, the image quality itself in photo and video mode is pretty bad considering this has a cell phone sized sensor, and the battery is trash. After fully charging it, if I dont use the camera for 2 days the battery goes down to 1/3 power just from being off on the shelf. Not too practical",
    "Camera is heavier than expected but not too bad. Biggest downside is the image quality at full zoom. After using it for a week in Yellowstone I decided to send it back because at full zoom - even on a tripod - the picture quality was not very good. At lesser zoom it was OK, but since I got it for wildlife and aviation pics I didn't think it was worth it for $$ vs. the iffy image quality.",
    "So far so good, but this camera is huge\nNot sure i would have bought it if i had seen it in person first\nBut of course we all buy this one for the incredible zoom\nBalance seems ok holding it with 2 hands",
    "I don't know how people are liking it.\nmaybe they don't know what a real camera is.\nthis is total fail.\nit's 2021 outside and this cameras focusing is worse than horrible.\nwhen zoomed in it just won't focus or won't focus clear enough for good quality picture.\nI had to wait 1-3 sec for it to focus in daylight\nand when done, picture still comes out fuzzy then before I pushed the shutter button.\nforget get about low light focus.\nthis shouldn't be on the market at all.\nreturning it back.",
    "If you're looking for a camera that can do just about everything, this is the one. Like a telescope that happens to be mounted to a camera, this one reaches out there like nothing I've ever used before. From gorgeous fall foliage, birds at a distance and indoors under flourescent light, it is impressive. Easy on battery life, too. Haven't used it for video yet, so may add more.",
    "Not a great improvement over the P900. Its zoom power compared to the P900's is not bigger at all. This camera is humongous, way too big. It is absolutely not heavy but its size is really off putting. Considering it was supposed to be an improvement over model P900 and being optical zoom the attractive point of these cameras, if you own a P900, it is not worth buying this one: not much better zoom and extremely large gadget. Not worth the upgrade!",
    "This camera is amazing and photo quality is unbelievable! I can’t say enough how much I love this camera!",
    "Pretty disappointed in Nikon. Build quality feels extremely fragile compared to D3XXX or D5XXX budget DSRL bodies that are around half the cost. Image quality is terrible, even with a pro carbon fiber tripod. It either underexposes, severely overexposes and washes everything out, or just blurs it all to hell. I'll try to see if there is some silver lining that I'm missing, but so far seems like my unit is either defective, or this model is simply underengineered.",
    "The zoom is fantastic, but the image quality leaves something to be desired. You need to have a tri-pod with you in order to stabilize the camera because it is so heavy and it doesn't fit well on anything. I would opt for a better quality camera",
    "I’ve been taking pictures for years and years. I’ve had many different cameras, all nikons. D100, D80, and before that 3 different film cameras. This camera is so user friendly it’s a blast to use. Price is high for it. Could of gotten a more pro camera but would not have that incredible zoom",
    "Incredible zooming and reasonably easy to use. It’s just too big. Portability is not a sell point. So instead of buying a good telescope, buy this and have a recorded file of your adventures.",
    "I absolutely LOVE this camera. Still trying to get great action shots on basketball games but other pic quality is fantastic!",
    "I got my camera Saturday, great shipping Amazon!! I love this thing. Have not had time to mess with all of the setting yet but will post another review after I do. This camera takes great pictures, but it is really heavy! I cannot wait to get the remote for it. Here are some pics that I have taken with it.",
    "This camera does more than I expected.",
    "Bought this bc had everything looking for, zoom is incredible, easy to use, has a rotating screen. Received it 2 weeks sooner than expected. Takes 30 min video. The camera's sensor is a little week which is the only downside but all the other advantages are well worth it.",
    "Quality of images from the Coolpix P1000 is EXCELLENT! It's a terrific versatile nature photography camera. What is most impressive is it's astral-photography capabilities. The Moon setting is a nice touch that enables mind-blowing close-up captures of the Moon and planets.",
    "My son is a professional in fotografic image so I gave him as a gift",
    "This is an awesome camera, understanding it quite heavy and, given the special extreme telephoto lens is slower to frame and focus. Given those who appreciate what it provides likely understand this, it removes my need for multiple lenses in my bag. I love it.",
    "Oh my lands, this camera is amazing! Took pictures of blue angels air show yesterday and the zoom allowed previously unattainable pictures! Pictures look professional. We had a P900, but this camera out performs that one and it was also amazing.",
    "Camera is nice, bit heavy, zoom is great ,after 27 days the camera stop working completely , after talking to amazon Tech to understand that they gave us an option before the 30 days to send it back and get full refund.\n\nCamera was send to Amazon before the 30 days and we were promised full refund, no refund was issued until today ( almost a month ) customer service reassured full refund\n. customer support or tech saying same story and promise 3-5 days for the last 3 weeks . seems they taking their time to stand behind the promise of refund or helping or giving any resolution , seems that the customer can wait. I will expect amazon that sells Nikon products to give the customer his money back so he can buy another camera but it seems now no money and no camera either .",
    "I use a camera primarily for shooting flowers and birds. The P1000, like its junior partner the P900, is very difficult to use in shooting action shots, particularly when the lens is extended.",
    "I replaced my p500 with this camera. Excellent\nLook, feel, and easy to shoot. Been buying Nikon Cameras for 30 years. Best money can buy. Only way to actually understand it is to try it out. Fantastic Range.",
    "Not so sure about this camera. It's been 2 months & it just hasn't taken great quality pictures. Looking at the moon is amazing but even with a tripod the pictures are fuzzy. Should invest in the remote but don't know if that would work either. Disappointed because of the price.",
    "The images from this camera are very soft despite aperture or shutter speed settings. I used this for a weekend throughout North Arizona up into the Grand Escalante. I should have stuck with my Canon 70D. The images from this camera are on average very soft, under exposed, and all around just poor quality. I was purchasing this to replace my Canon SX40 as my all-purpose easier to carry camera (as opposed to my 70D with L Series glass). My SX40 produces better pictures far more reliably than this camera does. Very disappointed. This camera is going back.",
    "Expensive but kind of worth it. It is a great camera. Great zoom. Good picture quality. Good video quality. I love playing around with this camera. Plenty of turoring videos on YouTube.",
    "This camera is beyond amazing!",
    "I love the picture quality of this camera. The only negative thing I can say about the camera is that’s it is heavy. I bought a vest to help with the weight.",
    "Works grwat for birds and wildlife. A little heavy but you get used to it and forget all about it when you are getting great closeups of the local wildlife",
    "its nice I love it , but unfortunately made in Thailand not japan.",
    "Just came via UPS. Just getting to look it over and try it out. Great packaging by Nikon and Amazon. Can't wait to do some shooting - will report how it works soon.",
    "Not a quick point and shoot but once you get the hang of all the different things this camera can do it is awesome.",
    "one size fits all, this camera maybe heavy but it's a lot easier than carrying around two or three other lenses. I've been having fun with it.",
    "Nice camera with excellent image stabilization. Attached photo was taken without using a tripod....hand held. The zoom lens is amazing",
    "Great camera for distance photos\nColor true. A tad heavy to carry for point shoot. Tripod needed or monopod.",
    "Ideal for extra long range photography. Its perfect for this but if you dont do a lot of long range stuff, reconsider as its heavy.",
    "What do you get when you cross a telescope with a DSL the P10000 of course it’s a little big but well worth every penny",
    "amazing camera",
    "I love my new Camera! Yeey!\nHave a look at the lunar eclipse from yesterday, with my P1000.....",
    "My favorite toy I've ever owned! I feel like I can do anything. :D",
    "Very poor in low light. Heavy. It’s a carry around telescope.",
    "Love it",
    "I've been waiting for this camera to come out. The zoom is incredible.",
    "The media could not be loaded.\nLike it. Just tried and got a good video.",
    "Love this camera! The zoom is incredible! Very happy with this purchase!",
    "Extremely happy with the function and multiple features of the camera.",
    "Amazed at what you can see at a distance with this camera!",
    "Not only did my $800+ camera arrive with issues, it was simply tossed in a box without lens cover attached, a few plastic bubbles (some deflated) LCD screen was turned so it could be easily damaged by the few accessories (not complete) rattling around in the same box with the unprotected camera. Camera was days late because it was \"accidentally left off the truck\". Needed for a job this weekend, so now I'm just screwed.",
    "Haven’t tested it yet on a trip.\nSampled images look great.",
    "Great camera, excellent lens however bulky and heavy!",
    "First I wanna say, let’s separate this camera away from a full frame camera with interchangeable lenses.\nThis camera is in a class of its own and it should not be compared to the other cameras.\nSo is this still good to buy in 2023? My opinion is yes. I don’t see a “newer version” of this coming anytime soon. Nikon is focusing more of their attention on the newer line up of full frame cams.\nIF we do see a new one, it’s going to probably have a better sensor and better quality of life features zoom will probably stay the same because honestly any further just causes more atmosphere distortion.\nAlso it will probably be more than 1000 bucks.\nSo I think it’s still viable to get.\n\nOkay, the sensor. Yes it’s small actually the size of a phone sensor. Remember you arnt gonna be getting razor sharp images. But just remember if you are satisfied with the way your modern phone takes photos. You will be satisfied with this. If you are a pixel peeper then you may want to pass. That being said modern phones with this size sensor take dam good photos still.\n\nLowlight. This camera is best taken during the day with as much light as possible plain and simple. Anything above even 800 iso, you might find a lot of noise in the image. Post production editing can definitely help a little though.\n\nLet’s all remember why we want this camera though.\nThe zoom. Just like we can’t compare a full frame sensor to this. We also can’t compare the zoom range to the common dslr set up, ESPECIALLY in this price range. To get a nice 800mm lens it’s gonna cost the price of almost a car.\n\nAs long as you understand what this camera is for then that’s good.\nNo your not gonna be shooting insane sports photography and birds moving through the air. But you will be able to go to a baseball game , sit in the nose bleeds, and get pretty dam good up close detail of what ever you point this thing at.\n\nUpdate: just realized the camera I got from the seller 6th Ave was grey market. Meaning it’s not designed for US sale and there will be no warranty if something goes wrong.\nThe camera seems fine and works like a charm but still kinda a bummer.",
    "Zoom factor is great. That is what I purchased this for. All of the handheld shots are blurry. So far not any usable pictures. Maybe on a tripod with a remote shutter if is better. I need to be able to just walk and shoot. Unfortunately I am past my return date. I think I will forget the mirror less cameras for now.",
    "Very nice camera, I love it",
    "The lents zoom is fantastic",
    "The best camara in the world",
    "The zoom at 3000mm is fantastic",
    "Amazing usability",
    "The concept of this camera is great, but the actual quality of this camera needs improvement. When using the zoom the picture quality is terrible. I used it on a tripod to get zoom pictures of wild life and the pictures were blurry and not usable. Very disappointed in the camera, it's being returned.",
    "I have returned this camera back to Amazon. No matter how good this camera is I just could not get over the size. Way bigger than a DSLR. Would not be fun to use. Best buy a good long lens and enlarge your photo to get that closeup look.",
    "Viewfinder case has fallen off, and I can't get Nikon 800 number to answer for assistance. \"You're trying to reach a voice mail box that has not been set up.\"",
    "So many things disappointed me. Picture quality. There is none. Editing software. Pitifully inadequate. Returning this big turkey immediatley.",
    "I recently purchased a used P1000 in almost \"like new\" condition from a different vendor. I tested it for a few days. I went to a nearby lake to shoot birds and nature and compare it with a full-frame Nikon camera (24 megapixels image sensor 6000 x 4000 pixels, equipped with a Sigma telephoto lens 150-600mm plus Sigma 1.4x teleconverter)\nAs a reminder, the sensor on the Coolpix P1000 is a cropped sensor that has 16 megapixels (4600 x 3400 pixels), while the sensor on the full-frame Nikon was a 24 megapixels sensor.\nI put a 77mm UV filter on both the Coolpix and the Sigma zoom lens.\nI was particularly interested in testing the focus function of the Coolpix since people complained of having problems. Being in full daylight, the Coolpix focus worked very well over the entire range. One problem people have is that they try to use the full 3000mm zoom magnification on a subject that is too close. In order for the lens to focus at 3000mm the subject has to be at least 7 meters away from the camera.\nAlso, I found out that the camera has some problems focusing at 3000mm when it is handheld, and there is little light available, such as in the late evening (or dusk).\nWhen I set the zoom of the Coolpix to 600mm, to be just like the Sigma lens on the full-frame Nikon, the focusing of the two lenses was comparable, although the Sigma was a bit faster.\nWhen I tried to take pictures of flying birds, the Sigma lens on the Nikon full-frame was better, faster than the Coolpix lens. The constant-AF of the Coolpix works, but it is not as responsive.\nAs an overall impression, images on the Coolpix are, perhaps, not as \"crisp\" as those taken with the more expensive, full-frame Nikon camera, but that is not an issue for me. I still got some beautiful images that only the large zoom made possible. To see what this camera can do I am attaching two pictures of the same osprey sitting by its nest. I merged the pictures into a single image to make it easier to post online. Pictures were taken in full daylight with the Sigma lens at 850mm (lens + teleconverter) and the Coolpix at 3000mm. In both cases, cameras were hand-held. Pictures were captured in RAW format, and both images were converted into JPGs and then reduced in size by a factor of 4, so they are smaller and easier to post online. Nothing was cropped out from either image. The original size in pixels of both images is depicted. In both images I measured the number of pixels available for the bird itself. As you can see, with the full-frame, 24 megapixel Nikon camera and Sigma lens at 850mm, the bird height was 730 pixels. By comparison, with the Coolpix camera at 3000mm, the bird height was 2500 pixels or about 3.5 fold larger. This makes perfect sense since the 3000mm is also about 3.5 times larger than the 850mm. If my Nikon full-frame camera had a 48-megapixel sensor (~$3000 for a mirrorless camera body only), the bird height would have been about 1100 pixels, still less than half of the Coolpix camera.\nTherefore, I think the p1000 Coolpix is a fantastic purchase. You can use it to bring subjects close and take pictures at magnifications that would only be possible with expensive professional cameras and professional lenses, costing many thousands of dollars.\nYes, the Coolpix images are not quite as sharp as those taken with professional Nikon lenses, the camera has a bit of trouble focusing in low light at 3000mm and is also not as responsive when taking pictures of subjects in motion (birds flying). For me, all of these shortcomings are overcome by the powerful zoom capability of the camera, as shown by the two images posted.",
    "I want to review this camera simply from the perspective of a birder. I have been using the P1000 for about 8 months now. I generally use it for taking photos that help me identify birds and other wildlife that I see while hiking and traveling. I end up often using the P1000 as a spotting scope for birds because it has a longer reach than my 12x50 binoculars. I also enjoy taking photographs good enough to post on my blog and to enlarge to print and hang in my office. The P1000 works well for all of my needs. Truthfully, it has made photography so enjoyable that my occasional hobby of wildlife photography has become something of an obsession.\n\nThe superzoom is, of course, the most important feature of the camera for birding and it has a very impressive range. No other camera, even my digital SLR Nikon with a 500mm zoom lens, can come close to the capabilities of the P1000’s lens. And, while the P1000 is a heavy point and shoot camera, it is lighter and more maneuverable than my DSLR and 500mm lens were in the outdoors.\n\nI also looked for a camera that didn’t require that I change the settings for each and every situation I encountered. Wildlife does not wait around for you to change the ISO or the f-Stop. The birding setting on the P1000 has generally been perfect in most wildlife situations. For more challenging birds in flight situations, the camera allowed me to preset a user preference setting. I just have to change the control dial from the “bird” setting to “U” and I am set up for birds in flight.\n\nOverall, I was looking for camera that would easily go wherever I wanted to go and the P1000 has filled that need. If you want a camera that you can use right out of the box to take great bird pictures, this one is it. If you want to slowly learn how to take better pictures using more DSLR-type features, this camera will allow you to grow as a photographer. It is also advanced enough to keep many more experienced amateur photographers happy. If I want to manually focus, manually set the aperture, manually set the shutter speed, etc., I can do that on the P1000. But I don’t have to when I don’t have time to do so. That kind of flexibility of both a high performing point and shoot and a mostly successful DSLR should put the P1000 on the wishlist for many birders. It has made my birding so much more enjoyable and was certainly worth the $1000 price.\n\nOne other note: I have had excellent warranty service from Nikon in the past and that has made me a very loyal Nikon buyer. Nothing about this camera has changed my mind about Nikon’s quality products.\n\nThere are a few drawbacks, but plenty of other reviewers have dwelt ad infinitum on those deficiencies. The p1000 is not perfect. My best advice is to get a detailed manual like the “Photographer’s Guide to the Nikon Coolpix P1000” and figure out how to overcome those deficiencies. It will help you learn to utilize more of this camera’s capabilities.",
    "I'm a novice and found this camera far too complicated. Too difficult to do easy things. I did not find the pictures to be very good.",
    "It’s a great camera for cheap (I’m a pro, this is quiteinexpensive within my industry).\nThe zoom does go to extremes. Though the slightest wind shakes it so prepare for that. (It is not true that all long zooms shake this much. There are plenty of very expensive zooms that dont shake regardless of wind. Just nowhere near this range.)\n\nI think you can assume it’s a pretty impressive camera for most purposes. 5 stars. But what I’m writing here for is to provide warnings about the few shocking shortcomings that I learned about the hard way, by surprise, on shoots, in real time. (Which make is particularly painful for high resolution nature videographers.)\n\n1) There are many claims that you can connect to an app, and control it via the app (wifi): This has not even close to succeeded once. The app has failed 100% of the time. Nikon acknowledges it. And if it were to connect, it would shift the camera away from 4k, and lock it into 1080p until you disconnect the app. When the app is repaired and connected to your canera, the camera immediately becomes a far worse camera.\n\n2) There are many claims that you can buy a remote control for this cam. And control it with the remote. (Bluetooth.) There are further claims that you can connect an HDMI cable to the cam. Both are true seperately. But connecting your HDMI cable disconnects your remote. Connecting your HDMI cable nullifies 4k and locks you to 1080p until you disconnect it.\n\nThere is no remote monitoring & recording of this camera.\nYou cannot plug in any app or monitor and hit record remotely.\nThe only version of remote triggering possible is: Unmonitored. You can set it to 4k and not connect any app or cables, back away, and hope your subject is in frame, and hit record with a remote... and just hope it started recording. - This camera is best: IN your hands, with you operating it.\n\n3) There is no clean HDMI output. It’s in the manual. It’s in the menu. But it was never implemented. You can switch the clean HDMI OUTPUT, on. And you will still have 100% of the screen readout displayed on your hdmi monitor. - The reason for CLEAN HDMI (which is uncompressed video signal that hasn’t been squished down into a compressed video file to be fit on your SD card) is to record the uncompressed, higher quality internal signal, to an external recorder. - This was advertised. It did not happen. Boo! - I want the full sensor readout. Uncompressed. Without writing on the screen.\n\n4) This is the worst low light camera I’ve ever owned. It’s shockingly bad. Nobody is worse than this. But it’s lowlight. That’s not Nikon’s job. It’s Sony’s job. When you need low light go to Sony. A7Siii if you can afford it. But in truth, this camera here is far more similar to the original a7s. No zoom on the a7s though.\n\n5) YOU CANNOT POWER THIS THROUGH USB... unless you use NIKON’s USB cable and wall outlet converter. The wall plug that comes with the camera, is smart. It is computerized. It sends a pin-1 data handshake to the cam that says: accept usb power from me. - So no. A power brick will not work. You MUST be near an outlet to use usb power. On the road that might mean you need your car running next to it to use an inverter. Which is ridiculous. But the good news is: BATTERY LIFE ON THIS THING IS AWESOME.\n\n6) The vibration reduction / image stabilization in this thing is genuinely terrible. - I say that using it alongside a sony a7R with a Tamron internal is lens. The two are not on the same planet of quality. Good IS costs 4X as much. Just dont take the brags about stability seriously. It’s your job to stsbilize this camera. They didn’t make a serious effort to do so.\n\nEnough for now. Will report changes & improvements over time.\n\nThis is a great 4k DAYLIGHT zoom that uses a HEAVY tripod, without slow-mo or remote, for cheap.\nIf that’s exactly what you’re here for, this is the best on Earth.",
    "I bought the P1000 one week ago from a local big box store rather than Amazon simply because (a) I wanted to handle it before making a final decision to buy and, (b) patience is not my forte (at the time, Amazon was out of stock). I'm an admitted Nikon Coolpix fan who enjoys shooting wildlife and landscapes so zoom is important to me. I started out with 42X P530 that I gifted to a family member after getting my current 60X B700 both of which I acquired here on Amazon. Prior to buying the B700, I had considered getting the P900 but one factor led me not to buy it: no RAW capability.\n\nWhen I saw the announcement of the September introduction of the P1000, I was intrigued by the possibilities that 125X zoom presented for wildlife and landscapes images. With 2+ times the zoom and a feature set that included 99.9% of those on the B700 plus more, I was more than casually interested. The P1000 takes more images (7 vs 5) in the continuous shooting mode. It also has a Bluetooth connection that allows remote shutter release when WiFi is not available when using the ML-L7 remote control, although that device seems to be a bit of a unicorn currently. It also has twice the maximum ISO, a faster Wide lens (Max Aperture Wide is 2.80 vs 3.30) although the B700 has faster Telephoto lens (Max Aperture Telephoto is 6.5 vs 8.0). Factors like the latter raised some other concerns.\n\nThe obvious ones were its size and weight compared to the B700. I'm often hiking on trails in state/national parks, forests and wildlife refuges to get to areas of interest so weight is particularly important to me. Based on my experience with the B700, I was comfortable that it was securely attached to my Amazon Basics monopod - i.e., I wasn't worried about it snapping off the attachment stud and having the camera go crashing to the ground. The P1000 definitely looked like it would need a sturdy but luggable tripod. The advertised battery life was about 100 shots shorter than the B700. Other things like a 16 MP resolution (P1000) vs 21 MP resolution (B700) sensor were also an issue although, since the B700 and P1000 have the same physical sensor size and type (1/2.3\" BSI-CMOS), they should provide the same level of control over the depth of field when used with same focal length and aperture. Finally, there was the economic factor. Was the cost of the camera and the \"must have\" accessories (carrying case, UV and CPL filters, another high speed SD card, the previously mentioned tripod, etc.) justifed by the additional capabilties? In my mind, the answer to that question and all the noted concerns could only be addressed by taking the camera into the field and looking at the unedited image quality.\n\nOther than reducing the size of the attached pictures (from 4608 x 3456 pixels > 1920 x 1440 pixels) to accomodate this review, these jpegs are unedited - i.e, no manipulation of the RAW data and subsequent conversion to jpeg. Note that the 1st & 2nd shot were taken from the same spot with and without zoom. The rest are just targets of opportunity during two days of developing a first impression of what the P1000 can do.\n\nBottom line: Despite my concerns about the P1000's weight and size, I've found that carrying it, framing shots quickly (motorcycle rider, for example) and shooting without a monopod/tripod produces excellent unedited image quality, at least to this amateur's eyes. While I will keep my B700, the P1000 is a keeper.\n\nParameters:\nAll shots: Camera handheld\nCamera mode: P Mode\nOriginal image Size: Fine + RAW\nMetering mode: Multisegment\n\n1st shot: F2.8, 1/200 second, ISO 100, 35mm equivalent focal length 28mm\n2nd shot: F5.6, 1/500 second, ISO 200, 35mm equivalent focal length 1000mm\n3rd shot: F6.3, 1/500 second, ISO 180, 35mm equivalent focal length 1700mm\n4th shot: F6.3, 1/500 second, ISO 220, 35mm equivalent focal length 1600mm\n\n5th shot: F3.5, 1/1600 second, ISO 100, 35mm equivalent focal length 60mm\n6th shot: F3.5, 1/1000 second, ISO 100, 35mm equivalent focal length 60mm\n7th shot: F3.5, 1/800 second, ISO 100, 35mm equivalent focal length 97mm\n8th shot: F3.2, 1/1250 second, ISO 100, 35mm equivalent focal length 41mm",
    "Nikon's Coolpix division hasn't always been first choice for many photographers including myself over the last 15 years or so. Until the P900/A900/B700 cameras I considered them to be nearly irrelevant.\n\nHowever, with the A1000/P1000 and even the B700 Nikon's Coolpix division is improving in all areas that annoyed me about them in the past. Many of the quirks and irritating issues in their designs have given away to more logical handling and build design, as well as excellent choices in adding features etc. for the price.\n\nThe P1000 is no exception. Starting on the outside it's an extremely well built and intimidatingly capable looking camera that handles nicely, it's got ample external controls in the right places for those who like to take control of the camera. The tilt and flip screen is also an excellent design choice, along with the addition of including quite a good electronic viewfinder. Overall Nikon has made something truly unique here, and that isn't something I say often about cameras in my reviews. Truly, this is a unique camera that is gaining quite the following for those who finally wrap their heads around it's design and realize that Nikon have made a spec. dream come true camera, and most of all that it doesn't suck!\n\nThe P1000 opens up more photo opportunities than any other single all in one camera before it, and is capable of doing so many more tasks as long as you have the creative drive to make it work for you (as well as know its limitations).\n\nI won't rattle on about the specs, you can read them yourself here and decide if they are good for you. Overall I'm pleased with the P1000 and this is only the second time I've liked a Nikon Coolpix camera (in well over 11 years of reviewing cameras online!). The first, is the A1000. This trend is a nice step for the division that has been sorely lacking in the past, and good change to see happen.\n\nNikon now just need to make additions of other Coolpix cameras similar to the A1000/P1000/B700 designs with 1\" sensors. Of course these cameras will have a little less reach, and be more \"premium\" in cost, but this is a worthy trade off for a larger sensor. Nikon need to keep the momentum they are on, and if they do, they can acquire a much larger following to the Coolpix division than in the past.\n\nAsk me any questions you'd like to know about the P1000 and I'll reply. I simply cannot make the assumption I know all the questions potential buyers will ask and answer them in a review. But, I will say I am happy with it. Your expectations may vary, we all have our own individual needs for a camera.\n\nI also will be doing larger format reviews of both the P1000 and A1000 on my blog online.\n\n-Carl",
    "Before I start this review, I want to say that I know virtually nothing about the technicals of photography/videography, so consider this review from the perspective of an average Joe who just wants to film stuff from far away.\n\nI was a massive fan of the P900 and that camera totally blew me away when it came out. 83x optical zoom, how could it possibly get better? Not to mention it worked great as a regular point-and-shoot camera too. Well, I immediately traded it in when I heard of the P1000 and got my hands on it as soon as I could (today).\n\nThe P1000 claims an optical zoom of 125x but the difference simply isn't that distinguishable. You can actually view YouTube footage yourself of the P1000 and compare it to the P900. The difference just isn't that apparent. I dunno, there are probably some other variables at play that eventually leads ever increasing optical zoom towards diminishing returns. The P1000 feels like it can zoom 10% further, maybe?\n\nOn the bright side, the controls and interface are much more responsive and snappy.\n\nAlso, the 4K is nice I guess, but it doesn't help my type of filming much. If you're looking for a super close-up shot of animals or flowers, I can see it being a benefit, but it doesn't do much to help improve the picture quality of a lighthouse from 5 miles away. The zoom also isn't as smooth or linear as it was in the P900, it's very twitchy and sudden. The P900 halted at the end of the digital zoom, making it easy to transition to the optical zoom. The P1000 doesn't have that. The transition is violent and makes the video look odd. It also feels like there is some weird stabilization or digital image manipulation mechanism which unpredictably tugs or jerks at the video. I'll play around with it some more and update this review. It could just be some settings that I need to disable. In the mean time, it's obviously the only camera on the market that can do anything like this without getting into the 5 figure price range, so kudos to Nikon in that regard.\n\nI am satisfied with it, it just wasn't the exponential leap in performance from the P900 like I thought it would be.",
    "I have a lot to say about this camera but I think everyone else has already said it. One thing I will point out is that this has a manual focus ring on the lens and the P900 and P950 DO NOT. That alone makes this camera a standout in my eyes. Also, no idea why this camera is now going for $1800... It was $1000 for a long time. I would not spend a dime over $1000 for this. Don't get me wrong it's a great camera but not for that much. For that much you can have a much more professional setup. If you really want this camera look somewhere else other than Amazon... I repeat, this camera IS NOT worth $1800 no matter what way you look at it.",
    "Just some general thoughts, as the physical characteristics & chip size do reveal already a lot.\nFor me it is a great point and shoot and gives me the fun back to take pictures which I was lacking for a long time now. Autofocus and ISO are probably the main weaknesses. The size and weight is just what you have to expect for a compact telescope with photo-shooting function. It takes surprisingly good videos, has WiFi & Bluetooth and therefore feel free to download the app and use your smartphone as a remote. Sending pictures back to your phone is easy as well. Overall built quality is just good enough to not give you the impression of being cheap.\nThe most expansive part, next to the optics, must be the motor moving that huge lens in and out. Let's say I hope it is one of the most expansive parts. Be aware that the impressive Youtube videos concerning the zoom are in real not as dramatic. It gives you the impression that the objects the people are zooming on are much further away then they really are. It's just an optical illusion. With your bare eyes everything is closer than reproduced by a camera. Nevertheless, it is the zoom which made me buy it and still lets me think it is worth the money I spent. Indeed think of this camera just as an mid-quality wearable little telescope, including the option to take photos. Good fun but certainly not DSLR print quality ! For high class results of birds in flight etc., you still need to invest 10 times as much as this little baby costs :)",
    "Biggest complain I read about this camera from early reviewers. it is big. I agree, this girl is rather voluptuous. But it is not larger than D500 if you F mount Nikkor 18-300 on it. Matter of fact P1000 is only 35g (roughly 1.5 oz) heavier. But then again, D500 with that lens has 10 times lesser reach.\nI’m planning a big trip in a month and I am honestly debating should I take my new P1000 that will give me flexibility between macro and 3000mm or should I take much more advanced and faster D500 and juggle all the lenses I have in my bag. I think I will go with former. Will share pictures then.\nP1000 has a greatest grip I’ve seen. If you just walking with your hand down, it balances well just on two fingers inside the grip. If you are taking a shot, you will need to use both hands but it feels great and fits perfectly, All controls are right where you want them.Stabilization on this camera is solid. If you have a good aim, you will get a good shot even with the lens fully extended to 3000 mm.\nI agree with anyone who would say it is wrong to compare D500 to P1000 however, for the benefit of those that didn't have a chance yet to take P1000 in their hands it is fair comparison.\nControls of P1000 are simple and intuitive especially for beginner. Zoom is spectacular beyond believe. It feels like the only limitation of the x125 zoom is the earth curvature and atmospheric effects especially on a hazy day.\nThis camera is nothing but fun to shoot with. It feels solid and the price is fair. RAW and 4K is great upgrade from older sister P900. EVF on P1000 is spectacular. Get the second Nikon branded battery. You will not regret having it in your bag.\nKeep in mind you will not be able to sneak this “fat bottomed” camera to the concert or arena if no cameras allowed. But, you will be easily taking pictures from the roof of the building even if it is block or two away.\nGet it and enjoy it.\nPS. Just a wishful thinking. Now that P1000 out, I wish Nikon comes up with P950 or something that shoots RAW and 4K. or just Raw if 4K is not possible without major upgrade. It would totally worth it.",
    "I had been thinking about the P1000 since a grandson showed me YouTube video of it. Then, out of the blue, my wife bought it for me. I like to photograph both birds and aircraft. This camera is amazing for those two subjects. Yes, it is heavier than many and the manual that you will have to download has over 200 pages of instructions, hints and tips on how to get the most from the camera. I have been getting some great photos of birds in particular.\n\nThe camera has two unusual settings: One is called bird and the other is called moon. The latter is for shots of the moon and the stars. Both setting have the capability to set a preferred 35mm equivalent telephoto setting so that when you push the main button (not the shutter release) the lens zooms to that position.\n\nThe only thing (so far) that I dislike is that the moon setting assumes you are going to hit the shutter release and then step back. After 3 seconds the camera takes the photo. While the delay can be turned off, that has to be done for each photo.\n\nYou should use this camera with a good tripod.\n\nThe first photo is of an American Coot, a bird rarely seen in my part of the country. The other bird is a female Cardinal. 35mm equivalent focal length is 3,000mm optical for both photos. The photo of the squirrel eating a mushroom stem is 1,400 mm.",
    "luckily i received mine on the 11th of September.. i didnt purchase from Amazon.. i honestly think it handles better than the P900.. yea it weighs a little more.. but i find it to be a good thing.. it's beefy.. as it should be for all the glass in it.. it does get a little top heavy zoomed out.. but not enough to be annoying.. i have taken some incredible shots with it.. the manual focus ring is awesome.. but i must tell you a heavy duty tripod is a must for fully zoomed shots due to the top heaviness when it is fully zoomed.. i learned this the hard way.. battery life has been great so far.. i also have the remote.. which has worked great with no issues.. should you upgrade from the P900? well if you want RAW.. manual focus.. much clearer OLED veiwfinder.. hot shoe.. well check out the info on Nikons site.. they can tell you more than i can.. all i can say is be aware it is a bit heavier.. but not to the point of being annoying or fatiguing.. as the grip is quite large and makes holding the camera much better than the P900.. i'm 49 years old and i handhold 99% of my shots with no issue.. anyways i have no regrets buying the P1000..",
    "The key to enjoying the p1000 is to set your expectations. No, this is not a full frame dslr, and you will not get photos similar to one. Yes, when you shoot long telephoto with this, your hands need to be super steady or your camera needs to be on a tripod. Yes, atmospheric haze will likely get in the way some days. Yes, it is heavy. And finally, for moderate to long zooming, its best done on a bright day because the maximum aperture goes down all the way to f/8 at the telephoto end.\n\nWith that said, what you can do is take photos anywhere from wide angle to very long telephoto of 125x. And at those distances, this is the only game in town. You can also use this for regular pictures, making this a great all in one camera for family trips. What you want to do with 125x is something only your creativity can answer, but it is there.\n\nI have used this camera for two weeks now and am very happy with its performance subject to the above caveats. Previously I owned the Coolpix p900 , it’s less zooming sibling and closest competitor.\n\nUpdate... for those who find it heavy, try cupping the bottom of the lens barrel with the palm of your left hand. Much more balanced this way and less of a strain.",
    "Great for taking pictures at a sporting event, nature, concerts, etc. at a far distance. I can sit in the upper level of a stadium and still zoom in on a player's face ( Tom Brady from sect.410 )",
    "Took mine to Cuba last week and ran into rainstorm, camera got soaked even hiding under shirt, display stopped working, the failed, too out battery let dry opened every orfice and now appears to be working fine. Great camera",
    "I love , love , love this camera. You can take photos of the moon or a macro photo. I always feel I will not miss that far away bird or animal when I can zoom out to amazing distances. I am always happy when I get home after a shoot with all my results. I would highly recommend this camera to anyone interested to getting amazing photos close or far away. I take it everywhere I go.",
    "bra",
    "The pictures are clear and features are great. The best feature is bluetooth which allows you to transfer pictures from your camera to your phone without doing anything after setting it up. The app is called Snapbridge and works great on my Note 8. No more need for USB data connection, all your pictures and videos transmit wirelessly to your phone within seconds. The build quality is excellent, the camera is heavy and well balanced but I don't mind it because with this range of optical zoom, the lense configuration will make this camera heavy. I had trouble viewing RAW files on my computer and the solution was simple. Go to Nikon software downloads website and download the appropriate patch to support RAW files. Overall, an excellent camera with a lot of features and amazing picture and video quality for day to day usage. Love my new camera and creating awesome sweet memories with it!",
    "A review for having used this 8 months\n\nPROS\n\n- Well, you wanted some real zoom and here it is\n\nCONS\n\n- The camera is massive and equivalent to carrying a 15lb dumbbell around your neck\n- At full zoom you’re going to run into atmospheric distortion that makes most images useless. Hot days, cold days at this distance everything just becomes a blur\n- You probably want this or wildlife pics, and birding is fine- but anything moving is going to get lost with the slow zoom speed and trying to find the target\n- You’d think for the size they might make it a bit more rugged, but it is a delicate little flower. Don’t take this out in the rain, Don’t take this out on cold days, don’t jostle it moving around\n- You might think you have a heavy duty tripod that will work keep this steady, but you are wrong. The lens is so front heavy extended almost any tripod is useless.\n- You’re paying $1k for a sensor that isn’t even as strong as the newest generation iPhones. For the price point you could go get some a low end mirrorless full frame with some real ability\n- The manual ring I thought would be a big improvement over the P900 and was a big selling point, but outside a still life its not very useful. Its almost a silly little thing to twirl now and again\n- Autofocus at long range just….doesn’t. It’ll find a target, look ready to shoot and then drop out of focus when you hit the shutter\n- Supposedly you can get a blurry pic of Jupiter or Saturn, but the camera refuses to focus on a tiny bright spot in an all dark sky.\n\nTL;DR: This was my 3rd Superzoom from Nikon, and the most disappointing. The P500 was a small camera with decent range and perfect for hiking and birdwatching. The P900 had better range but was twice as big and nowhere near as sturdy.\nThe P1000 looks like it should be top of the line with such zoom capability but it’s has so many points against it I definitely would recommend spending 1K on this dumbbell of frustration.",
    "There's only one reason to buy this hand cannon/camera, and it's to take pictures of the moon. No, not that moon, stop using it to spy on your neighbors. I'm talking about the moon in the sky. But I mean, really, how many photos of the moon do you need? If you really want that, then this is the best that you can get without tacking on an extra zero to the price. You'll be getting 2017-ish cellphone quality shots, albeit with a tad bit more magnification, with most other photography styles.\n\nThis was more of a novelty camera for me. I used it to take some photos of that great solo satellite in the sky and then sold it when my interest waned. (yep, that was a moon pun. I went there.)\n\nMore on my Instagram: @DorkTenderloin",
    "I wanted the zoom for shooting bird pixs. I accepted the smaller sensor, I am not shooting pro photos, I shoot to please me. The camera is incredibly capable for my purposes. It is heavy. Run the zoom out and you can feel the weight transfer forward. Hand holding is doable with great care, tripod or monopod is better way to go. Bottom line, I accepted the compromise and am very pleased with my results. BEFORE you buy, you need to know what is important to YOU. I have one camera with all the lenses I want in one package.",
    "Great bridge camera with the best super zoom. With any super zoom many things can effect picture quality & definitely use a tripod for best results. Great picture quality. Automatic mode works well & enough manual settings to explore yourself. Video work well. Microphone works better then expected. No problems in low light & light adjustment ring is a very nice feature I use a lot. Can easily get 350+ pics on one battery charge & more if managed right. Charging time from full empty about 3-4 hrs. Very happy with my choice.",
    "I love this camera. The zoom is amazing. I can't believe I actually have one. Great for wildlife, which is perfect since I live next to a game refuge. We have lots of wildlife right in the yard. We have a very large field which I can now take photos of the wildlife that is on the other end of the field, where I couldn't before. I am excited everytime I take it out.",
    "The Camera was on awesome deal on prime day and couldn’t resist at the price of $103! This camera is fantastic, though the 16 megapixels May bum some out it’s pretty great for up close pictures and zoomed in as well! Many features! Battery Life is great in my opinion, though wished the megapixels were a tad bit higher, I can’t complain at the price of $103.",
    "Love it awesome camera gets better as I use it. Its big and heavy. A real guys toy. Ladys would love to it.does it all shooting 4 corners this summer.",
    "Gift from my son. Best camera ever owned. My SLR may gather dust! This camera is awesome. Too many 'plus' features to name. It has put the joy back into photography.",
    "It was a nice idea. If only you could focus on an object before it moves away. I believe you will regret it if you buy one.",
    "Clear zooming power, AAA+++++",
    "Being able to connect to a smart device wirelessly to access photos and videos was an important consideration for me when I bought this camera. This feature no longer works. In attempting to connect, you experience the frozen progress bar where nothing happens until you get frustrated and cancel.\n\nCheck the latest reviews of SnapBridge, the Nikon app, in the AppStore. The all have similar feedback\n\nIn the description of the latest version of the app (2.6.2), Nikon acknowledges the connection issue. This version was released 4 months ago!",
    "Didn’t know what to expect as I was buying a “used” camera….but there wasn’t a sign of wear on this baby! I couldn’t be happier! All functions are as advertised…and so much more! The P1000 is an amazing camera! It’s truly a camera in a telescope with a computer brain. Get it if you can.",
    "All I can say, is just, Wow 🤩! This camera is amazing and has so many features that works for the kind of pictures I take. Came packaged ok, but was wondering why it was not sealed with a security seal; especially because of the value of it. Anyway, it was not damaged and takes amazing pictures. Thank you.",
    "This is a great camera, and it’s zoom capability has sparked my interest in photography again, and I’m grateful for that. I’ve found that nature pics resolution at full lens range (3000mm) is lacking. However at 1000mm I’ve taken some amazing shots—-just point and shoot. I expect once I get a sturdy tripod the images may improve but I am pleased with the results from this camera.",
    "Excelente equipo si lo que buscas es experimentar la toma de imagenes y video a gran distancia, la calidad de imagen es buena aunque no esperes la calidad de una mirrorless de gama media, obtendras la calidad de un celular de gama alta pero con la particularidad de que la distancia desde la que podras tomar imagenes o video sera por muchos cientos (tal ves algunos miles) de metros mayor, ten en cuenta que es un equipo bastante grande y pesado por lo que seguro llamaras la atencion en cualquier lugar donde lo lleves, tomar fotografia de la luna con este equipo es un deleite aunque te recomiendo adquirir un tripie ya que es un poco complicado mantener el enfoque a mano, en definitiva es un equipo para divertirse, no esperes iniciar como fotografo ya que no este no es el equipo adecuado para ese fin",
    "The media could not be loaded.\nTengo la P900 y yo pensaba que no sería mucha la diferencia en tamaño y peso, pero es inmensa!!!! XD no me esperaba semejante animalón!!!!!\n\nEn cuanto al envío, todo llegó en orden y bien, no llegó sellada la caja pero es normal, no tengo problema con eso. Está intacta con sus accesorios y manual. El manual viene en inglés, francés y árabe.\n\nEn cuanto a la calidad de las fotos mañana la estrenaré para capturar aves, se que no me decepcionará porque la p900 fue muy buena!\n\nMe tengo que acostumbrar a su peso y tamaño, pero estoy muy contento con mi compra!\n\nYa la estrené con aves y vaya que facilita muchísimo el enfoque, mucho mejor que con la p900!!! Me encanta, sólo hay que configurar la calidad de imagen y todo lo demás, pero es una maravilla!\n\nTambién como dato extra, el formato de video que tiene hace que el archivo no pierda el audio cuando lo compartes en redes sociales! La p900 nunca me dejó compartir sus videos von audio.\n\nEstoy muy contento con mi compra!",
    "Soy un fotógrafo aficionado. Estoy precisamente en el proceso de migrar a un nivel un poco más profundo de estudio y práctica. Tengo una cámara DSLR Nikon D3000 y sustituí una Nikon Coolpix P520 por esta Coolpix P1000. Descubrí que en esta fase de incursión en la fotografía, mi estilo fotográfico es logrado con mayor facilidad mediante la versatilidad de la lente zoom, más que estar usando la DSLR con objetivos intercambiables ( que ofrecen muchas virtudes en términos de calidad de imagen ), además del elevado costo de inversión ( los lentes intercambiables son muy costosos ). Además, necesitaba una cámara que me ofreciera la rapidez del modo automático para los eventos familares que no requieren de mucho trabajo de composición, pero que a su vez, me ofreciera las virtudes de los modos semiautomáticos y el modo manual para la creación artísitica con más paciencia y tiempo. He encontrado que la Nikon P1000 me ofrece todo lo que necesito en este aspecto, hasta el momento. La calidad de imagen no puede ser comparada con la calidad que ofrecen los lentes fijos intercambiables de las DSLR, pero es muy, muy buena. Para un aficionado principiante que está por primera vez adquiriendo un equipo y que en realidad no está muy seguro de si va a continuar con la fotografía, en lo personal no recomendaría este equipo porque, para empezar, debido a la naturaleza de sus características, es muy pesado. Para un aficionado de este tipo, yo recomendaría una bridge más ligera o, si lo prefiere, una DSLR.\nAhora, en cuanto a las caracterísitcas de la Nikon P1000: me asombró su avance tecnológico en lo que a la rapidez de compensación y sensibilidad a la luz tiene. ¡ Pude tomar, increíblemente, una fotografía de la Luna inclusive en el modo automático ! Eso no puede ser logrado sencillamente por muchas cámaras. Pero la P1000 incluso tiene un modo ya prefabricado para tomas exclusivas de la Luna. Pude hacer fotografías en modo automático y luego las repetí en modo manual para ver las diferencias, y fueron mínimas, esto es, muchas fotos en el modo automático, la Nikon P1000 las toma con una nitidez, balance de blancos y compensadas de una manera muy notable y muy aceptable. Cosa que no puedo ver en mi DSLR D3000 ( se necesita más trabajo manual ) o siquiera pude ver en la Coolpix P520. En definitiva, Nikon hizo un avance asombroso con este modelo, según mi opinión, para el tipo de fotografía que estoy realizando ( tipo de fotografía y, obvio, el nivel de presupuesto que puedo manejar al momento ).\nEl zoom es una bestia. Pueden ver los ejemplos. La caseta de las antenas de comunicación está en el Cerro Coronel que puede verse, lo tomé a una distancia aproximada de 10 Km. La foto de la colina muestra en la cúspide un grupo de personas. Puse una foto de un postre tiramisú que hizo mi esposa y la tomé con el modo de Gastronomía ( claro que una foto de alimentos necesita mucho más trabajo y composición pero esta fue una foto de urgencia pero puede verse que en verdad, no está mal ). Puse una foto de la Luna y, ojo, SIN tripié, a pulso. Tiene un sistema genial del control de la vibración. La fotografía del árbol navideño del Centro de la Ciudad también la tomé a pulso en modo de prioridad de apertura,sin tripié, pero debo decir que hice otras tomas en modo automático y no había una diferencia sustancial.\nSi preguntan por alguna comparativa entre esta cámara y su hermana menor, la P900, les recomiendo ésta, la P1000. La P1000 dispara en RAW ( para post edición ) y graba video en 4K UHD y tiene zapata para accesorios ( flash, micrófono, etc ), cosas que la P900 no.\nEn resumen, Nikon P1000, altamente recomendable para el fotógrafo aficionado, aficionado avanzado y, ¿ porqué no ?, hasta de uso general para alguien que no le moleste cargar 1.46 Kg para obtener unas maravillosas fotografías.",
    "Saca fotos de la luna impresionantes!!!",
    "Magnífica camara",
    "I love this camera. My \"stars\" are for the camera itself. BUT it's a grey market camera... means the seller isn't \"approved\" by Nikon.\nI asked about the warranty card... was told it would be in the package... it wasn't. But I did register it on the Nikon Canada website\nLets hope it never breaks down. Because I've been told Nikon will NOT support grey market cameras.\nJust be careful",
    "Great deal from a reliable store! Thanks for being so cooperative",
    "Muy buena camara y muy versatil con lente todo en uno. Es grande y pesada pero vale la pena. Seria grandioso que el procesador de imagen fuera de mayor resolucion. El zoom es increiblemente potente. Para nivel intermedio",
    "La uso para fotografiar aves en un 90%. Realmente es lamentable que no traiga GPS como su antecesora P900 (la cual utilicé durante tres años sin problema alguno) ya que después de largas jornadas/viajes es imposible recordar exactamente en dónde tomaste la imagen además de perder mucho tiempo en ello para subir las fotos a plataformas de aves... Realmente me parece que no es tan significativo el alcance del zoom que la P900 sabiendo que estás cargando con mucho mayor peso... el que no esté sellada también es un problema para el uso que le doy... sino te interesa la ubicación de tus tomas, es una excelente opción, sino es que la mejor, para fotografiar naturaleza por su relación calidad/costo.",
    "Bought it for my husband for nature photography. He loves it!",
    "My Wife loves her new camera. Great for wildlife but a great all round camera. It is heavy but spend the money and buy a tripod. It will be worth it. The zoom is fantastic. Now if there was only a way to double it.",
    "Great camera for wildlife and moon shots.",
    "buena camara",
    "Great camera! Superbe lens ! Fantastic lens! Unfortunately, Poor yesteryear sensor result poor resolution result poor images! in a 4K UHD screens and cameras world...We are looking to the future!",
    "Ces le meilleur pour un nouveau, et je le suggère, simple et performance.\nMoi je l'utilise comme backup et 2iem matos. alors ils est -parfait.",
    "My son is a photographer and he was very impressed by this camera and said it was a great purchase.",
    "Tengo un par de semanas con la cámara. No quise escribir algo en cuanto la recibí (lo cual fue muy rápido) sin antes haberla probado, durante un tiempo.\nAhora puedo decir que esta cámara me FACINA! Es muy útil! Con diferentes funciones que me permiten obtener el mayor provecho de cada imagen capturada. Así mismo tiene funciones manuales que permiten hacer un trabajo más fino al momento de enfocar objetos.\nEstoy fascinado con el zoom óptico que tiene.\nRecomendable!!!!!!!!",
    "Es un equipo fantástico para captar la naturaleza, pero el zoom para ver la luna es fascinante.\nLo que no me agradó del todo es la velocidad de la captura para el modo automático, pues algunas veces las fotos tienden a sacar un poco movido al objeto enfocado. No sé si se trate de un tema del cálculo automatizado de la obturación o simplemente del estabilizador de imagen.\nEn general el equipo es estupendo.",
    "Ware kam schnell und vollstaendig an. Kamera kam aus Spanien und in einwandfreiem Zusatnd - neu und original verpackt. Leider keine Deutsche Bedienungsanleitung dabei !",
    "estoy muy contento con la compra que realice, tenia mis dudas pero en definitiva es una camara versátil, no se puede comparar con las de lentes intercambiables, porque es otro nivel para lo que la utilizo me resulta muy útil y tienen una gran calidad en la imagen es un poco pesada 1.2k pero no hay problema.",
    "Cámara muy grande y pesada, pero con un Zoom de esas características es bastante adecuada (y hasta ligera podría decir), fotos muy buenas, aunque con una resolución mayor seria increíblemente buena.\nUna muy buena compra en relación precio y características.. Completamente la recomiendo.\nCon ella consigues fotos muy especiales.",
    "Nikon is discovering new invention,\nFeels like closed with genius people\nEncouraging science and technology.\nTechnology is one of the best.",
    "Simplemente me encantó. Sí, no es una cámara profesional porque no vas a obtener fotos profesionales pero son muy buenas aún así.\n\nYo la veo más como un juguete de niño grande porque es muy divertido el zoom.\n\nEn general, vale lo que cuesta (yo la compré en 14,000 pesos).",
    "Great zoom, decent picture quality. Wonderful for birding. Auto focus can be a bit slow at high zoom levels. Tripod recommended for high zoom but VR is pretty effective even without it and one can get by sometimes even with handheld shots at fairly high zoom levels.",
    "Lo mejor es su súper zoom.",
    "Excelente producto, superó mis espectativas y es una hermosa cámara. Recomiendo adquirirla en oferta ya que el precio es elevado, pero aún así vale la pena invertir en esta cámara. Llegó antes de lo esperado y la enviaron en una caja que la protegió excelentemente",
    "To the price paid performance is excellent.",
    "Excelente câmera para viagens, com uma só lente te dá desde grande angular a um zoom equivalente a 3.000 (125 X).\nMeio pesada - é claro - mas muito prática.\nCom novos recursos e ainda filma em 4K.",
    "Very good zoom....stability....\nDislikes...lens good not stable...",
    "Si te es difícil comprar un Telefoto nikon por su costo. Esta cámara vale la pena, pierde un poco de calidad en relación a una lente especializada pero manejándola en manual y con formato RAW Da más o menos resultados",
    "En comparación de resolución de imagen con equipos del mismo precio aún le falta para tener una imagen tan clara como en esos equipos pero en cuestión del zoom+imagen está increíble, no se arrepentirán muy buen equipo versátil todo terreno",
    "Me gustó mucho el zoom optico de 125x. Es importante invertir en un buen tripié, lo necesirtarás. No te decepcionará. Muy buen producto, pasa las fotos al celular en instantes."
]