[
    "Had doubts about this being legit but it is 100% REAL VERSACE DYLAN BLUE!\nThis is my 1st Versace cologne and today was the first time wearing it at work and man, I've gotten a bunch of compliments! Apparently it \"smells so good compared to your old cologne\" which was CK Eternity (my 1st colognes). This is definitely one I will keep on using but also want to try Flame and Eros",
    "Ordered this to replace my daily fragrance. I was worried that I would receive a fake bottle, but was relieved when an authentic product arrived.\n\nThe scent is nice and not overpowering, which is good as I share a space with coworkers and would not like for them to made uncomfortable to be around the fragrance. It is a nice deep scent with hints of citrus and spice, which is good for all occasions. The longevity is also really good and I am getting a good 5-6 hours on about 2 skin application sprays and once on my shirt for a bit more longevity, though you can probably get by with another spray if you want it to be more pronounced.\n\nOverall, it is a fantastic budget fragrance and with it being 3.4 oz, it should be a fragrance you can wear daily for months to a year, but your milage may vary. If you are on the fence about it, go ahead and order it because you will not be disappointed.",
    "My son absolutely loves this. He just started high school and he says it makes him feel older. 😂😂😂. But really a great light. Masculine smell I love it.",
    "it smells amazing especially the opening notes, but idk if im going nose blind to it, but it seems to only last like 2 hours",
    "At first it smells of alcohol. But shortly after it smells like juicy fruit gum to me. Especially when I spray it on my shirt. I love the smell of this! I'm gonna score for sure, lol. I recommend this. I actually recommend most of Versace fragrances.",
    "It was my dad bday and I gave it to him and he loved it\nPerfect gift",
    ". Wear this with confidence",
    "The fragrance is very good, but it’s not as long lasting as others in this price rage.",
    "Excelente",
    "I love the scent but it doesn't stay long at all. And if you want someone to smell it you have to spray like twenty sprays. Smells amazing tho.",
    "Great perfume with a subtle fragrance.",
    "Great scent. Some colognes give me a scratchy throat and this is one of them. My son has no problems and loves wearing it instead.",
    "I like i purchased this last year & it last me for while maybe it’s because I only spray once cause it does have the amazingly strong scent but it’s not for everybody I love it!\nThe scent has woody aromatic & fougère type",
    "Uno de mis encantos, las lociones y mas las de esta marca. De todo mi gusto esta marca y sus fragancia",
    "Huele súper rico, ame el olor .",
    "Great everyday scent You can wear to the office, date or just out with friends that will get you smelling good. One of my most complemented fragrances in my collection. I grab DB when I can’t decide what to wear. The ladies loves this fragrance.",
    "Love this scent and its gender friendly. I get so many compliments when i wear it.",
    "Listen the bottle this comes in has such a beautiful blue, the product is extremely potent",
    "Quickly delivered, well packaged and product as described. Very pleased!",
    "Great smell, great durability on body.",
    "Damn just damn! Great bday gift for hubby ! He loved it and it’s a plus for my nostrils!!! Smells so good! Two sprays and you are good",
    "I really like it, it smell really good it is what I expected I actually purchased it for someone birthday",
    "Great smell , and the women love it",
    "Because I like to smell goods",
    "So let me start off with that I have no real idea if this is legit or not, but if it is fack then it's a pretty good fake to me.\nSo I didnt even mean to purchase this bottle, I had mistakenly bought this thinking it was a diffrent scent from versace. A manger I had at one point would wear versace's eau fraiche and had told me it was called just blue, so I surched it up and bought this one thinking it was what he had immediately new it was the wrong one when I received it and smelled it. That being said, I like this scent too much to return it, so I think that says something about it, but I'll leave that to mean what it will to you.\nIn terms of the legitimacy of it, well all i know is on the bottle that I got there isn't anything on the bottle that would indicate that it's fake. The wrapping on the box was identical to that of references I had looked up and all the detail on the bottle itself seemed to lined up as well. But thats all good and all, but just because the bottles authentic doesn't mean the liquid inside is, which is arguably the most important part. I have no real reference to how this should smell, but the scent i got smells really good and seems good quality. Also if is was a fake scent in the bottle I feel like there would be evidence of tampering on the bottle or the plastic wrapping it came in.\nAs to the longevity of it, will it last all day? Ehhhhhh well maybe, but certainly not for sure. It wares off and gets weaker over time like any other cologne, but i can still catch pretty good wiffs of it on me a good couple ( 5-6) hours after applying it. Its not as strong as I thought it would be, but I don't know if it should, but that's not really all that bad because the scent lends itself to being a little lighter and more subtle rather then right in your face. But that does mean that I end up needing to use more of it then I expected to get the desired effects, but I don't think I'd blame the cologne for that.\nSo should you take a chance on buying it? Sure, go for it, mine turned out alright, but do keep in mind that I have no way of guaranteeing that the bottle you get will be the same as the bottle i got, because they might be selling older product that they bought in bulk and that's how they can offord to sell it at a cheaper price, so be a little cautious.",
    "Versace Dylan Blue is a nice cologne. Not the best and greatest cologne, but it's good enough to get the job done for most situations. The cologne has a fresh and clean smell, with notes of incense and other ingredients that gives it an aquatic/ocean vibe. It lasts about 3 to 5 hours, depending on the environment. I bought it mainly as a nice cologne that I don't have to worry about using up, because it's fairly cheap, to be used for my weekend part time job. I have other colognes, but I don't want to use them for that part time gig.\n\nI also find I reach for it sometimes when going to the groceries or doing other errands. It's the type of cologne that won't bother a lot of people, but won't stand out much either so I wouldn't wear this for a date or special event. It's not my favorite cologne, but it's nice to have and an easy wear for casual situations. I'm glad I bought Dylan Blue discounted here on Amazon (sold and shipped by Amazon) instead of paying full retail price for it. The bottle and box have a very dark blue color and had all the details and markings of an authentic product that you would buy at a physical retail store. Not sure I would buy it again since it's not my favorite, but I'm definitely glad that I got to try it out and own it for far less than what it would cost at a perfume store.",
    "I got the results I paid for. Definitely had my fingers crossed hopping this was the real thing, but it's not. Has a stronger smell of alcohol or something. I give it three stars because I didn't break the bank to purchase but still just another knock off product. I need to spray several times and only last about a few hours.",
    "Product real deal wife loves it on me",
    "This is the 1st time I've tried Versace Blue Dyan. I should have tried it sooner, It has a great Scent lasts 6 hours...",
    "A blind buy.\n\nSmells great on application , but nearly disappears on dry down.",
    "Probably the best scent I’ve owned, not as long lasting but pretty decent (couple hours). I wear this everywhere ever since I got it and I got couple compliments here and there. The smell is not overpowering so someone has to be closer to you to smell it",
    "It smells good, but it does not last long... tops an hour or two.",
    "My son loves this stuff. I’m not a huge fan of the small but maybe it’s just a teen smell",
    "Love the scent. I've had a few people ask me what I was wearing. It's a very smooth scent.",
    "Huele a alcohol mezclado con perfume, lo comparé con otro igual pero comprado directamente a la marca y se nota mucho la diferencia. Es una réplica muy mal hecha. Si van a ordenar este perfume asegúrese que sea directamente a marca el vendedor.",
    "Smells awesome.",
    "Great price for a great musk\n\nBlind buy….worth it.",
    "Buena fragancia me encantó, fue un regalo de cumpleaños para mi esposo.",
    "SOLID scent . It’s ideal for all year round . Very versatile. Definitely worth the money . Try it out !",
    "Scent is very nice and would certainly buy again.",
    "I was so excited to get this that I unwrapped the plastic packaging before taking a picture, but yes the box came sealed in plastic and is definitely the real scent. I'm obsessed with this fragrance. Very fresh, intoxicating, smells a bit like the ocean/ water but wayyyyy better. My favorite scent, will be buying this again!!!",
    "Not so sure if I got the real deal or not this is my first purchase of Dylan Blue so idk what the authentic smell really is, so I did some research and everything adds up to it being real but the batch numbers 1068S.0 don't. The website I used to check is checkcosmetic.net I'm also showing the batch numbers of my Pour Homme that I bought at Macy's years back and the reason is because if I switch the S in to a 5 then the batch shows up but on my Pour Homme you can see its clearly a 5 not a S that should be a 5, is this a bad typo on their end or what that's what leaves me thinking is this really real or just a really good duplicate.",
    "I really enjoy the sent. It starts off very masculine than goes into the green apple so its sweet and full. It lasts a long time. So it is worth the price.",
    "He Loved it!!!",
    "This scent is great but it doesn’t last long.",
    "Smells amazing",
    "Smells synthetic. Not a fan. I'm just glad it was a cheap fragrance.\n*Seller shipped item quickly. This review is purely on product not seller*",
    "Bought for husband who loves it. When I ordered it, it said it wouldn't come until January, but arrived in time for Christmas.",
    "Smells great. Good size, bottle and packaging was very nice as well.",
    "Tiene buena apariencia, como de woow !\n\npero la verdad el aroma solo lo dejamos en bueno,",
    "Love the scent, but wish it would last more than an hour.",
    "I love everything about this the price especially is more than half than what you'll pay in the department store",
    "This is my first dylan blue and I think it is pretty good",
    "Fragrance was nice but didn’t last",
    "This is my new favorite fragrance. I’ve bought a few lately and this one is the best. Wish it lasted longer but smells great while it’s there.",
    "This cologne smells like a mixture of Very Sexy for men by Victoria’s Secret mixed with Dior Sauvage . Sent last long enough for a Versace cologne . Gets lots of compliments so Id buy again . My favorite cologne of all time is Creed Aventus but with the cost of that this will be in my rotation lol . Go ahead and buy .",
    "Buenisimo",
    "This fragrance was a great blind buy for how affordable it was. It smells super clean and fresh, perfect for casual wear anywhere and anytime. It lasts a decent amount of time on bare skin using only 2-3 sprays total, roughly 5-9 hours from what I've experienced: overall great purchase and a fantastic budget fragrance.",
    "Es estupenda esta fragancia y le gustó mucho a quien se la regalé.- También me agradò el precio y la recibí a tiempo…😊👍🏼🍀💝….Gracias!!!",
    "This is not a real authentic Versace Cologne! I have compared this one to the real one I have side by side. While the bottle is a very good copy, the scent is way off. The best I can describe the fake scent is a cheap, overpowering, chemical perfume you’d find at a dollar store. Very disappointed in my purchase!",
    "Buen producto",
    "Would totally recommend to friends and family.",
    "Been using this fragrance for a few months now. It's a great signature scent that lends more toward mass appeal than a distinct or unique fragrance which was exactly what I was looking for.\n\nThe fragrance lasts for a decent amount of time, initially it may be overpowering if you apply and immediately are in close proximity with others such as in a car, but applying ~20 minutes before going out seems to be the sweet spot for my use. Anything over a few hours may require reapplication if you want anyone other than yourself to notice the fragrance depending on how much you initially apply.\n\nThe glass bottle that the fragrance comes is great and a bit more elegant that some of the other fragrances out there which I personally appreciate. The atomizer (spray nozzle) gives a nice full spray, but because I prefer to apply very little fragrance, I find myself only pushing the applicator halfway down (not a huge problem)\n\nI have received a few compliments from others when wearing the scent, but apply only very little fragrance as I don't want my fragrance to arrive before I do.\n\nI would definitely recommend this fragrance as a first fragrance or signature scent for all ages. I am 20 years old, consider my style timeless and business casual, and I think the fragrance suits me very well.",
    "I’ve bought this before in stores but was surprised at how large this bottle is! It’s double the size as the one I previously owned. I’m not complaining though!\nIt’s a wonderful scent and I get compliments on it often.",
    "Gives grown man smell",
    "It's a night out scent, great for all weather's and seasons, the longevity is pretty good up to 6 hours or more.",
    "Five stars",
    "My boyfriend went out and he had heads turning trust me .. I love it .",
    "Scent is top-tier but it's kinda low key which can be your preference...a little more power and projection this would be 5 stars",
    "Just a little Pricy but worth it",
    "A gift to my boyfriend, which I use on my favorite sweater to feel calm. Love this scent so much. It’s a great size for the price.",
    "I love Versace Dylan Blue Cologne! I receive more compliments on this Cologne than any other Cologne that I wear!",
    "Buenos",
    "My husband loved it",
    "Scent is lovely, projection is really good, bottle looks cool too!",
    "I get constant compliments when I wear it. It last hours. The large bottle is an excellent value for what you’re getting. I will definitely be purchasing this again!",
    "I am a fan but my wife is not so I’ll likely rarely wear it 😂",
    "I bought this product with my girlfriend in store initially, where for the same price as this, I was only able to buy half the amount. It was extra terrifying because this angry Russian lady checked me out, and seemed like she wanted to murder me even though I was buying this from her. When I got out to my car, I realized I failed to check on amazon, and found this glorious product. Double the amount for the same price I paid in store. So I had to go back in and was greeted by insults, death glares, and my refund from the angry Russian lady. She sucked. But I then bought this product and it was not a knock off in any way. Smells the same as it did in store. I am glad I bought this product, because in no other situation would I have been belittled by an ethnic woman, and smell so great. 10/10 would never buy from a Russian lady. 10/10 would buy off of here again. Seriously she was terrifying. I am pretty sure she keyed my car too. But now I smell fantastic, and my girlfriend thinks I smell divine. Which I do. But you know who doesn't smell good? That Russian lady. She smelled of coffee beans and hard candy. And if you are reading this angry Russian lady, I DID see you flip me off as I left.",
    "Its smells nice.",
    "I’ve used this cologne every single day for the last 6 months, the women I work with always ask “who smells good?”\nTo which I reply “is it me?”\nThe answer is consistently a resounding “yes!”\n\nThat’s great for a guy who cares about his scent. Before I go to parties or events I douse myself in Dylan Blue Versace cologne and relish in the compliments. If you’re looking for a fragrance that stands out: this is the one.",
    "It's a very nice clean and fresh scent that's definitely not overbearing. It's a good value for the money and versatile. The only downside I can mention is its longevity. On me, it only lasts a couple of hours, if that.",
    "Smells great for the summer time",
    "My husband loves this cologne and so do i.",
    "Authentic. Bottle matches my last one from Sephora. Tested vs my store bought and it matches",
    "I was gifted the smaller Versace Blue nearly 3 years ago from the Versace online store. The bottle, smell, packaging, etc. is all legitimate and worth the investment for a luxury cologne.\n\nThis one is huge in comparison and will probably last me 3-4 years with occasional / everyday use. Just so you’re aware, all you need is one spray on the wrist and just rub it all over yourself. It’s guaranteed to last for over 24 hours and the smell is absolutely top tier. I get complimented on the smell very often when in public. The smell is not super overwhelming either, which for some people is a turn off. You’ll be very satisfied and will want to get it for the rest of your life.",
    "I got this for my boyfriend and he LOVES it. He’s gotten several comments when we’re out and about on how good he smells. I adore it too :)",
    "Un perfecto perfume para hombre se queda en tu cuerpo y en tu ropa impregnado y la chicas querrán tener sexo contigo cuando sientan ese olor 😜😜😜😜",
    "Oh the smell I love it and it was a gift for my love",
    "Love the way this column smells!",
    "It's good but I thought the longevity was over hyped. Good fragrance though",
    "I think that so far all of my recent purchases of fragrances have been a winner for me. I must admit, I purchase blindly based on reviews and sometimes I will just order a small sample online before I decide to purchase a larger bottle. Dylan Blue from Versace has been a fully blind purchase purely based on reviews but also based on a small sample bottle of Eros (sweet scent) that I enjoyed. After receiving and using Dylan Blue a few times, the scent really has grown on me and has become one of my go-to scents for all occasions. I believe this is a great and fresh summer scent with aquatic references. It is fresh and spicy and has citrus topnotes and musky, amber and aquatic basenotes. It will last up to 6 hours on my skin after which it becomes only noticeable close to the skin. It has a distinctive different scent when compared to Prada L'Homme which I also reviewed on Amazon. Both are actually nice office scents that make you smell nice and sophisticated without being offensive. So far my fragrance purchases on Amazon have provided me with the real deal so my experience has been great.",
    "Very versatile, smells good, good performance, all around solid for the price.",
    "Not sure if I got an old stock because it wears out within 10min of application. Doesn’t project or last at all.",
    "The scent is amazing, nothing too overpowering. Good for a night out or a party. It could be better on longevity though but other than that it’s great.",
    "Bottle and packaging is real but the fragrance may be weak or in my case missing completely.\n\nI can assert these are defective due to other buyers having similar issues with scent and performance and the fact that they are discounted. Also I have owned the real stuff for almost a year. Item is not eligible for refund or returns so buy at your own risk.\n\n(Rated 5 stars so you will get a better chance at seeing this)",
    "Huele maravilloso",
    "Love this ... fresh, attractive scent",
    "My sons loved the smell I can’t stand the scent.",
    "Product smells exactly like the sample I got from Von Maur. This is an excellent fresh scent and at $75 for 200ml its hard to beat",
    "Buenas fragancias",
    "its a good fragrance. I get a lot of compliments on it",
    "Great smell and lasts all day.",
    "Fue un regalo para mi hijo y le gustó muchísimo",
    "I’ve tried a couple colognes in the last few years but this is the first one where I got a compliment.\n\nFor a guy that’s worth 5 stars right there!",
    "Smells great and lasts pretty long, well worth the buy if you like Musky scents.",
    "My teenage son bought this cologne. It smells very masculine & nice. Not too overpowering.",
    "This is the everyday cologne that I use when going to work and when attending a function. The product smells are pleasantly appreciated by many. A lot of people who bumped into me for the first time leave me with positives feedbacks about the quality of the scent, which gave me a cause to stick to this cologne, and I do love it. I highly recommend it but do not over-apply it on yourself. It should be mildly used, which is two to three sprays for the entire day.",
    "Great scent lasts long and great price for tge amount of ml",
    "It’s a good strong scent that lasts. I have been gifting this cologne for a few years and they’ve been loving the scent. Great gift.",
    "Great smell. Get it you'll love it",
    "Nice bottle, scent an package. Well done",
    "Pleasant sent just smells old",
    "Decent scent. This was a blind buy. Not very happy with the fragrance smell. This is just an ok one and there are far better perfumes for the price. Got a great deal on Amazon. Probably won't be getting another bottle of this one.\n\nMuch better alternative to this is Versace Pour Gimme which is a very fresh Fragrance though not very long lasting.",
    "Purchased because we really liked the scent when purchased elsewhere. However, the scent of this one was quite different than the one previously purchased. Very disappointing.",
    "I like it very much.",
    "I've been using Versace Dylan Blue for a few years now and have ordered it from this vendor twice. It is just as advertised by the vendor.",
    "I've always been skeptical of ordering cologne online because I was concerned that it might be a fake version of Versace Dylan Blue, but to my relief, it's 100% authentic. I sprayed it on and went to the dentist's office and received two compliments from dental hygienists.\n\nWhen you first put this cologne on, the smell is incredible. As it dries on your skin, the scent changes a bit but is still fantastic. The only downside I have is despite spraying myself five times, it doesn't have a lot of longevity because it doesn't last more than three or four hours on my skin. The longevity is what prevents the cologne from being perfect, but otherwise, I really like the cologne and have enjoyed the compliments.",
    "This is authentic product. I was a little worried because when mine arrived the bottom of the wrapping appeared to have been opened. However, I looked up the batch and it was authentic (around 7 months old). I then sprayed this on one arm and the same product from Macy's on the other and they lasted exactly the same amount of time on my wrist and projected equally throughout the day. I assume it was during transportation that the plastic packaging was displaced. So don't worry about the product being fake, it is authentic and smells fantastic.\n\nAs far as the smell goes: it's fantastic. Last night I wore this for movie night with my girlfriend and smelled my neck about once a minute the whole time and said she loved it every time. I own a lot of different colognes and she enjoys most of them, but this one seriously blue the rest out of the water.",
    "Decent size use for travel and always get lots of compliments.",
    "very nice versatile fragrance and you can’t hate the smell.",
    "Es muy similar a EROS pero tiene algo en el fondo que la hace especial.",
    "I bought this for my husband's birthday and it came super quick! This is his favorite scent so I'll definitely be buying more",
    "Great fragrance definitely worth the money I will be buying this one again anyone who smells it likes it",
    "All",
    "GLAD I BOUGHT IT! Was thinking of canceling my order after watching YouTube videos suggesting not to purchase cologne on amazon. Read some reviews from people claiming the product was fake. After further research I found a site that calculates legitimacy of Amazons Versace blue and an Amazon comment with how to verify fake bottles compared to real. I just researched the batch number after receiving the cologne two days earlier than due arrival and my batch was made April of 2020! Bought some cologne at the mall prior and it’s batch was made June 2019!!!",
    "Smells very good I would recommend and lasts long",
    "Es original tal como lo esperaba",
    "I purchased this wanting to get it cheaper than what Macy's was selling it for.\nI can't speak for anyone else's experience but my own, that said, nearly everytime I sprayed this cologne, I ended up getting a headache. The fragrance was either too strong or just not the real thing.\nI was upset because everyone was saying how good this fragrance was and it definitley not the experience I was hoping for...until...I actually went to the department store and tried the tester, the tester smelled far more fresher and smooth compared to this purchase. I plan on getting the real thing soon from the department store.\n\nI don't know if I just got a bad batch or if it was a fake, packaging looked real so I was sure it was the real thing. Buying fragrance on Amazon is a hit or miss. Even though you spend more, at least you have peace of mind knowing you are getting the authentic product from the department store.",
    "Wonderful scent. Masculine. You feel desirable😜",
    "I started using this cologne a month ago and since then I was able to pull the baddest girl at school. This stuff will literally change your life for the good.",
    "Versace Dylan Blue is an incredible fragrance that makes any man feel young and sexy! This Fragrance has a clean fresh scent to it that is pretty potent, a small amount goes a long way such as 2-3 sprays. If you are going out to a bar or club then more like 4-5 sprays to catch peoples attention! It has great performance, lasts an easy 10 hours. I guarantee this fragrance will not disappoint! Overall it has a great price point for being a designer fragrance.",
    "I purchased this cologne after smelling a sample in a magazine. The smell is amazing the bottle lasted me almost a full year with 2 sprays a day. If you are buying this as a gift or just for yourself you won't regret it.",
    "I just received my 6.7 is (200 ml) bottle of Versace Dylan Blue from this seller. Smells amazing and is original Versace cologne. Plastic wrap around box was neat and sealed w about 2 mm or 1/8 in seams. Versace logo on top of box was centered. Liquid math on box was correct. Batch code on bottom of box was correctly printed. Box itself was single print words (fakes have double printed letters ), inside box was blue (fake is black). Cologne bottle cap underside flat \"ring is golden (fakes are all black under there), straw in bottle was clear (not white), batch code on bottom of bottle matched the batch code on the bottom of the box, medusa emblem on bottle is detailed and its metal color matches the atomizer and bottle cap, atomizer button has medusa emblem on top. Cologne smell is Godly and Devine.",
    "me encanto 200% recomendado 😉",
    "Smells great, worthy purchase",
    "Great smell. A little pricey.",
    "The smell is musky and robust with a hint of almost sandalwood but not too overpowering, a little goes a long way and it gives me the “mans man “vibe, he LOVES it, but I think I love it more!",
    "I like everything about it, no dislike",
    "If this is a fake it is an incredible replica! The scent is dead on, the packaging, box and bottle are all dead on when compared to our old real bottle. From what I can tell it is real. My husband always wore Pour Homme but has recently switched to Dylan Blue because it is a more mature scent. It is very masculine with hints of citrus and a slight \"fresh\" or \"powdery\" scent. (normally I dont like powder smells but this one works with the citrus and slightly floral top notes). It leans slightly more to a fruity smell than floral but is not feminine at all. The papyrus adds a wonderful woodsy scent to it as well. I highly recommend this.",
    "I absolutely love this cologne for my husband it smells amazing bottle was bigger than expected",
    "This perfume is very weak in projection and Sillage. Fragrantica website shows it's more powerful, so I assume the batch was bad or the product is FAKE. DON'T buy",
    "Here's the thing. A lot of the time a lot of fake fragrances are sold on amazon. And trust me, I know off the bat if a fragrance is real or fake depending on how it looks/smells. But honestly this fragrance is legit. It smells exactly like the Dylan Blue I would buy at Macy's or Nordstrom and it lasts just as long and gets a ton of compliments. And the price is great. I gave it 4 stars just because it is really only a fragrance for the hotter weathers like late spring or summer and I like versatile fragrances. But it smells amazing and lasts for 8+ hours.",
    "It smells clean and nice... Its not unique or anything really... It's just okay. If you are going out to grocery store and you want to look and smell nice... If you are out and about running quick errands... And not staying out all day... I guess this is the cologne. It smells clean and nice but doesn't have a wow factor to it. Not a compliment god or anything... I wonder if anyone notices I am wearing it. It projects for about 30-1hr and it disappears but it stays on your shirt and skin for around 24hrs but you have to smell it real close. My only disappointment? That it doesn't project for long. And the scent is a familiar scent with Versace colognes so nothing really special about it",
    "Awesome product. I’ve been a Versace cologne loyalist for about 5 years and this scent is by far my favorite. The scent is very subtle, lasts a long time, and a great value when it comes to volume & price. The scent doesn’t assault the nostrils like a can of Axe, not is it low key. I’ve received numerous compliments from others, especially women, when going out or at work. If you’re concerned about legitimacy, I compared my cologne to the ones sold at Macy’s and it was an exact match. Highly recommend this cologne!",
    "Smells really good my gf loves it",
    "Purchased blind. Smelled so good I purchased a second one the same day I received the first one. Not a fan of floral scents or typical church lady perfumes. As a woman that prefers fragrances directed towards men but not too strong, this is such a perfect balance and fresh scent. Saw a few Sauvage comparisons. I like this one a lot more.",
    "I didn’t know what to expect from this fragrance. I watched a few videos for it online and it received mixed reviews. I decided to buy it anyway. Why not? When the fragrance arrived I tested it out and I like it. The best way to describe Dylan Blue is by saying it smells like a bar of soap. It has a fresh, clean, and a little sweet scent to it. It’s pretty basic, but it smells nice and I get compliments when I wear it. If you want to smell like a clean bar of soap, then buy this.",
    "",
    "I love the smell. Blind buy and its going to be my go to everyday. 2-3 sprays and you'll smell it for almost the while day I'd say a good 8-10 hours.",
    "So my coworkers male and female liked this cologne and it is a good scent to me but my girlfriend hates it lol I'm keeping it anyway and going to wear it regardless whether I'm around her or not but probably won't buy it again after I'm done with it's use lol there are other go to daily colognes that are much better for around the same price"
]